90 : Job ID 7281f8fb405b4188bc2657844c608eff
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (13, 60), end pos: (13, 63)
operator: core/NumberReplacer, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut - cas - cass, -1.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
........................................................................ [ 86%]
...........                                                              [100%]
83 passed in 0.15s

91 : Job ID 5783c78b33484178b77bc9d72642c1a6
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (19, 49), end pos: (19, 50)
operator: core/NumberReplacer, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -16,7 +16,7 @@
         venit_net = self.venit_brut - total_taxe
         return {
-            "venit_brut": round(self.venit_brut, 2),
+            "venit_brut": round(self.venit_brut, 3),
             "cas": round(cas, 2),
             "cass": round(cass, 2),
             "impozit": round(impozit, 2),
........................................................................ [ 86%]
...........                                                              [100%]
83 passed in 0.15s

92 : Job ID 3cdd54cbeee04582950f7ee9cb160231
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (19, 49), end pos: (19, 50)
operator: core/NumberReplacer, occurrence: 3, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -16,7 +16,7 @@
         venit_net = self.venit_brut - total_taxe
         return {
-            "venit_brut": round(self.venit_brut, 2),
+            "venit_brut": round(self.venit_brut, 1),
             "cas": round(cas, 2),
             "cass": round(cass, 2),
             "impozit": round(impozit, 2),
........................................................................ [ 86%]
...........                                                              [100%]
83 passed in 0.16s

93 : Job ID 9f2762cd15ca49bc8527b887edf52f06
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (20, 30), end pos: (20, 31)
operator: core/NumberReplacer, occurrence: 4, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -17,7 +17,7 @@
         return {
             "venit_brut": round(self.venit_brut, 2),
-            "cas": round(cas, 2),
+            "cas": round(cas, 3),
             "cass": round(cass, 2),
             "impozit": round(impozit, 2),
             "total_taxe": round(total_taxe, 2),
........................................................................ [ 86%]
...........                                                              [100%]
83 passed in 0.15s

94 : Job ID cbb8adeeb8034438820f4a597aa10ea3
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (20, 30), end pos: (20, 31)
operator: core/NumberReplacer, occurrence: 5, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -17,7 +17,7 @@
         return {
             "venit_brut": round(self.venit_brut, 2),
-            "cas": round(cas, 2),
+            "cas": round(cas, 1),
             "cass": round(cass, 2),
             "impozit": round(impozit, 2),
             "total_taxe": round(total_taxe, 2),
........................................................................ [ 86%]
...........                                                              [100%]
83 passed in 0.16s

95 : Job ID dbaac6ca03b2483e881aa6e9fbd52a73
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (21, 32), end pos: (21, 33)
operator: core/NumberReplacer, occurrence: 6, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -18,7 +18,7 @@
         return {
             "venit_brut": round(self.venit_brut, 2),
             "cas": round(cas, 2),
-            "cass": round(cass, 2),
+            "cass": round(cass, 3),
             "impozit": round(impozit, 2),
             "total_taxe": round(total_taxe, 2),
             "venit_net": round(venit_net, 2),
........................................................................ [ 86%]
...........                                                              [100%]
83 passed in 0.16s

96 : Job ID eeba6ac5bd8943ba8a68d039386a4141
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (21, 32), end pos: (21, 33)
operator: core/NumberReplacer, occurrence: 7, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -18,7 +18,7 @@
         return {
             "venit_brut": round(self.venit_brut, 2),
             "cas": round(cas, 2),
-            "cass": round(cass, 2),
+            "cass": round(cass, 1),
             "impozit": round(impozit, 2),
             "total_taxe": round(total_taxe, 2),
             "venit_net": round(venit_net, 2),
........................................................................ [ 86%]
...........                                                              [100%]
83 passed in 0.16s

97 : Job ID 1a858ed0d94740ddbeb842b9f740e3fa
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (22, 38), end pos: (22, 39)
operator: core/NumberReplacer, occurrence: 8, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -19,7 +19,7 @@
             "venit_brut": round(self.venit_brut, 2),
             "cas": round(cas, 2),
             "cass": round(cass, 2),
-            "impozit": round(impozit, 2),
+            "impozit": round(impozit, 3),
             "total_taxe": round(total_taxe, 2),
             "venit_net": round(venit_net, 2),
         }
........................................................................ [ 86%]
...........                                                              [100%]
83 passed in 0.16s

98 : Job ID d2bda07659104a79ab2258c3945fb073
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (22, 38), end pos: (22, 39)
operator: core/NumberReplacer, occurrence: 9, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -19,7 +19,7 @@
             "venit_brut": round(self.venit_brut, 2),
             "cas": round(cas, 2),
             "cass": round(cass, 2),
-            "impozit": round(impozit, 2),
+            "impozit": round(impozit, 1),
             "total_taxe": round(total_taxe, 2),
             "venit_net": round(venit_net, 2),
         }
........................................................................ [ 86%]
...........                                                              [100%]
83 passed in 0.16s

99 : Job ID 37f7127c327743199dd6813fb90faadb
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (23, 44), end pos: (23, 45)
operator: core/NumberReplacer, occurrence: 10, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -20,7 +20,7 @@
             "cas": round(cas, 2),
             "cass": round(cass, 2),
             "impozit": round(impozit, 2),
-            "total_taxe": round(total_taxe, 2),
+            "total_taxe": round(total_taxe, 3),
             "venit_net": round(venit_net, 2),
         }
........................................................................ [ 86%]
...........                                                              [100%]
83 passed in 0.15s

100 : Job ID 3fef989537dd42948ea685dd22d4b046
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (23, 44), end pos: (23, 45)
operator: core/NumberReplacer, occurrence: 11, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -20,7 +20,7 @@
             "cas": round(cas, 2),
             "cass": round(cass, 2),
             "impozit": round(impozit, 2),
-            "total_taxe": round(total_taxe, 2),
+            "total_taxe": round(total_taxe, 1),
             "venit_net": round(venit_net, 2),
         }
........................................................................ [ 86%]
...........                                                              [100%]
83 passed in 0.15s

101 : Job ID 7758e9535b9c4cb787aa328592d9b9d4
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (24, 42), end pos: (24, 43)
operator: core/NumberReplacer, occurrence: 12, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -21,6 +21,6 @@
             "cass": round(cass, 2),
             "impozit": round(impozit, 2),
             "total_taxe": round(total_taxe, 2),
-            "venit_net": round(venit_net, 2),
+            "venit_net": round(venit_net, 3),
         }
........................................................................ [ 86%]
...........                                                              [100%]
83 passed in 0.16s
