1 : Job ID 9548c33c21b447f6b55d519b736cdf5f
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (46, 25), end pos: (46, 26)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -43,7 +43,7 @@
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas - cass + impozit
         venit_net = self.venit_brut - total_taxe
         return {
..............................................................F
================================== FAILURES ===================================
____________ TestStatementCoverage.test_pfa_calculate_normal_case _____________
self = <test_statement_coverage.TestStatementCoverage object at 0x000002BD4D04ECF0>
    def test_pfa_calculate_normal_case(self):
        """Cover normal PFA calculation"""
        calc = PFACalculator(120000, 2024)
        result = calc.calculate()
        assert result["cas"] == 19800.0
        assert result["cass"] == 7920.0
        assert result["impozit"] == 9228.0
>       assert result["venit_net"] == 83052.0
E       assert 98892.0 == 83052.0
tests\test_statement_coverage.py:74: AssertionError
=========================== short test summary info ===========================
FAILED tests/test_statement_cov

2 : Job ID c6d8ad5a78e54f2f8b14d217d9c81add
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (46, 32), end pos: (46, 33)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -43,7 +43,7 @@
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas + cass - impozit
         venit_net = self.venit_brut - total_taxe
         return {
............................................F
================================== FAILURES ===================================
______ TestEquivalencePartitioning.test_venit_brut_valid_small_positive _______
self = <test_equivalence_partitioning.TestEquivalencePartitioning object at 0x000001FEE6D9B490>
    def test_venit_brut_valid_small_positive(self):
        """Test valid equivalence class: small positive venit_brut"""
        # Small income, below minimum wage thresholds
        venit = 10000  # Less than 12 * 3300 = 39600 for 2024
        employee = EmployeeCalculator(venit, 2024).calculate()
        assert employee["venit_net"] > 0
        assert employee["total_taxe"] > 0
        pfa = PFACalculator(venit, 2024).calculate()
        assert pfa["venit_net"] > 0
>       assert pfa["total_taxe"] >= 0  # Might be 0 for low incom

3 : Job ID 311c471332f2412692ea78a1c9710879
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (46, 25), end pos: (46, 26)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -43,7 +43,7 @@
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas * cass + impozit
         venit_net = self.venit_brut - total_taxe
         return {
.............................................F
================================== FAILURES ===================================
______ TestEquivalencePartitioning.test_venit_brut_valid_large_positive _______
self = <test_equivalence_partitioning.TestEquivalencePartitioning object at 0x000001E6713D3230>
    def test_venit_brut_valid_large_positive(self):
        """Test valid equivalence class: large positive venit_brut"""
        # Large income, above all thresholds
        venit = 500000  # Much larger than 60 * 3300 = 198000
        employee = EmployeeCalculator(venit, 2024).calculate()
        assert employee["venit_net"] > 0
        assert employee["total_taxe"] > 0
        pfa = PFACalculator(venit, 2024).calculate()
>       assert pfa["venit_net"] > 0
E       assert -391586040.0 > 0
tests\test_equivalence_partitioning.py:65

4 : Job ID f2d1b08297f746f0ab5f302fe7db4699
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (46, 32), end pos: (46, 33)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -43,7 +43,7 @@
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas + cass * impozit
         venit_net = self.venit_brut - total_taxe
         return {
.............................................F
================================== FAILURES ===================================
______ TestEquivalencePartitioning.test_venit_brut_valid_large_positive _______
self = <test_equivalence_partitioning.TestEquivalencePartitioning object at 0x000002DC9C2F3230>
    def test_venit_brut_valid_large_positive(self):
        """Test valid equivalence class: large positive venit_brut"""
        # Large income, above all thresholds
        venit = 500000  # Much larger than 60 * 3300 = 198000
        employee = EmployeeCalculator(venit, 2024).calculate()
        assert employee["venit_net"] > 0
        assert employee["total_taxe"] > 0
        pfa = PFACalculator(venit, 2024).calculate()
>       assert pfa["venit_net"] > 0
E       assert -911111800.0 > 0
tests\test_equivalence_partitioning.py:65

5 : Job ID eba0c7eeec654f1e94832a67bee39987
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (46, 25), end pos: (46, 26)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -43,7 +43,7 @@
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas / cass + impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000166F19AE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x00000166F194EF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self.rules["pfa"]
        expense_ratio = pfa_r

6 : Job ID 0a2095621f9d4c629dc5362c99f1f896
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (46, 32), end pos: (46, 33)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -43,7 +43,7 @@
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas + cass / impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000291DCECE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x00000291DCE6EF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self.rules["pfa"]
        expense_ratio = pfa_r

7 : Job ID c4f7a5206c6047209123142de42b0adb
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (46, 25), end pos: (46, 26)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -43,7 +43,7 @@
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas // cass + impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002843612E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x00000284360CEF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self.rules["pfa"]
        expense_ratio =

8 : Job ID f9fc9d1208db429f94e2803f4a16dd55
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (46, 32), end pos: (46, 33)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -43,7 +43,7 @@
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas + cass // impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001CAF27FA350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001CAF279EF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self.rules["pfa"]
        expense_ratio =

9 : Job ID 464a8e895136410cac962a349a5bdfa7
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (46, 25), end pos: (46, 26)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -43,7 +43,7 @@
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas % cass + impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000024DE351E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000024DE34BEF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self.rules["pfa"]
        expense_ratio = pfa_r

10 : Job ID 39eb274613304f35b659a6dcfef0a939
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (46, 32), end pos: (46, 33)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -43,7 +43,7 @@
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas + cass % impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001F10C4EE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001F10C48EF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self.rules["pfa"]
        expense_ratio = pfa_

11 : Job ID 4c4bcfe0aa984184b392e89e4ec4abd5
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (46, 25), end pos: (46, 26)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -43,7 +43,7 @@
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas ** cass + impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001EBE7B7E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
        pfa = PFACalculator(0, 2024).calculate()
>       assert pfa["venit_net"] == 0.0
E       assert -1.0 == 0.0
tests\test_boundary_values.py:32: AssertionError
=========================== short test summary info ===========================
FAILED tests/test_boundary_values.py::TestBoundaryValueAnalysis::test_venit_brut_boundary_zero
!!!!!!!!!!!!!!!!!!!!!!!!!! stopping after 1 failure

12 : Job ID 22ac1f7102d54f0089ddf90d23e6569b
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (46, 32), end pos: (46, 33)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -43,7 +43,7 @@
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas + cass ** impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000022C4042E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
        pfa = PFACalculator(0, 2024).calculate()
>       assert pfa["venit_net"] == 0.0
E       assert -1.0 == 0.0
tests\test_boundary_values.py:32: AssertionError
=========================== short test summary info ===========================
FAILED tests/test_boundary_values.py::TestBoundaryValueAnalysis::test_venit_brut_boundary_zero
!!!!!!!!!!!!!!!!!!!!!!!!!! stopping after 1 failure

13 : Job ID c2bc7f3f41024f4494c73186b6339301
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (46, 25), end pos: (46, 26)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -43,7 +43,7 @@
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas >> cass + impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000018C03BCE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000018C03B6EF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self.rules["pfa"]
        expense_ratio =

14 : Job ID 1a09f1a0423648e591837ad4d1f44451
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (46, 32), end pos: (46, 33)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -43,7 +43,7 @@
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas + cass >> impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002C0237BE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000002C02375EF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self.rules["pfa"]
        expense_ratio =

15 : Job ID 98db6775d60a4f5fa0be8e869eed3943
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (46, 25), end pos: (46, 26)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -43,7 +43,7 @@
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas << cass + impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002115F00E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000002115EFAEF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self.rules["pfa"]
        expense_ratio =

16 : Job ID 6ab4f9009916416bb27e42629cce4440
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (46, 32), end pos: (46, 33)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -43,7 +43,7 @@
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas + cass << impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001D7BB39E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001D7BB33EF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self.rules["pfa"]
        expense_ratio =

17 : Job ID 139bd328fdb14472822c37209ea82e5e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (46, 25), end pos: (46, 26)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -43,7 +43,7 @@
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas | cass + impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000026D22E5E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000026D22DFEF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self.rules["pfa"]
        expense_ratio = pf

18 : Job ID bedb195ca0bf452f82e6dc25af2f0b1a
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (46, 32), end pos: (46, 33)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -43,7 +43,7 @@
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas + cass | impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000022D75C0E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000022D75BAEF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self.rules["pfa"]
        expense_ratio = pf

19 : Job ID bdfc345a47f540cf9e8ad7686ce6c032
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (46, 25), end pos: (46, 26)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -43,7 +43,7 @@
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas & cass + impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001736F20A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001736F1AEF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self.rules["pfa"]
        expense_ratio = p
