20 : Job ID 201fe794e3894aebb7a7c01b389d77f5
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (46, 32), end pos: (46, 33)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -43,7 +43,7 @@
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas + cass & impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000023D1002E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000023D0FFCEF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self.rules["pfa"]
        expense_ratio = p

21 : Job ID a09b1fe5300c4d7eb0067e3741fc2310
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (46, 25), end pos: (46, 26)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -43,7 +43,7 @@
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas ^ cass + impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000212278AE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000002122784EF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self.rules["pfa"]
        expense_ratio = p

22 : Job ID 20aa8c84e2cb4c69976f1cd826927129
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (46, 32), end pos: (46, 33)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -43,7 +43,7 @@
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas + cass ^ impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000017FBC33A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000017FBC2DEF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self.rules["pfa"]
        expense_ratio = p

23 : Job ID 609d3f1c795845818fcc6408d9f3f09d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (34, 50), end pos: (34, 51)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -31,7 +31,7 @@
         cheltuieli = self.venit_brut * expense_ratio
         # Current model uses a configurable flat expense ratio.
-        venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
+        venit_net_impozabil = max(self.venit_brut + cheltuieli, 0.0)
         cas_base = self._get_cas_base(venit_net_impozabil)
         cas = cas_base * pfa_rules["cas_rate"]
......................................................F
================================== FAILURES ===================================
_______ TestMutationKillers.test_kill_mutant_sub_add_cheltuieli_nonzero _______
self = <test_mutation_analysis.TestMutationKillers object at 0x00000155A58BEC10>
monkeypatch = <_pytest.monkeypatch.MonkeyPatch object at 0x00000155A58F0D70>
    def test_kill_mutant_sub_add_cheltuieli_nonzero(self, monkeypatch):
        """
        Omoară mutantul Job 23 (venit_brut - cheltuieli → venit_brut + cheltuieli).
        Injectăm expense_ratio = 0.20 astfel că pentru venit = 100000:
          cheltuieli = 100000 * 0.20 = 20000
          CORECT:  venit_net_impozabil = 100000 - 20000 = 80000
          MUTANT:  venit_net_impozabil = 100000 + 20

24 : Job ID 2358abdd0d06441cbbab59794e379d56
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 47), end pos: (42, 48)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil + cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
..............................................................F
================================== FAILURES ===================================
____________ TestStatementCoverage.test_pfa_calculate_normal_case _____________
self = <test_statement_coverage.TestStatementCoverage object at 0x0000017EECEBECF0>
    def test_pfa_calculate_normal_case(self):
        """Cover normal PFA calculation"""
        calc = PFACalculator(120000, 2024)
        result = calc.calculate()
        assert result["cas"] == 19800.0
        assert result["cass"] == 7920.0
>       assert result["impozit"] == 9228.0
E       assert 13188.0 == 9228.0
tests\test_statement_coverage.py:73: AssertionError
=========================== short test summary info ============

25 : Job ID dee4f10ce144421c9f3bf2c919d275c8
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 53), end pos: (42, 54)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil - cas + cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
..............................................................F
================================== FAILURES ===================================
____________ TestStatementCoverage.test_pfa_calculate_normal_case _____________
self = <test_statement_coverage.TestStatementCoverage object at 0x000001EA58D6ECF0>
    def test_pfa_calculate_normal_case(self):
        """Cover normal PFA calculation"""
        calc = PFACalculator(120000, 2024)
        result = calc.calculate()
        assert result["cas"] == 19800.0
        assert result["cass"] == 7920.0
>       assert result["impozit"] == 9228.0
E       assert 10812.0 == 9228.0
tests\test_statement_coverage.py:73: AssertionError
=========================== short test summary info ============

27 : Job ID 963ef9a5b6f445df8046c879bcb04ff3
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (34, 50), end pos: (34, 51)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -31,7 +31,7 @@
         cheltuieli = self.venit_brut * expense_ratio
         # Current model uses a configurable flat expense ratio.
-        venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
+        venit_net_impozabil = max(self.venit_brut * cheltuieli, 0.0)
         cas_base = self._get_cas_base(venit_net_impozabil)
         cas = cas_base * pfa_rules["cas_rate"]
.........................F
================================== FAILURES ===================================
_______ TestBoundaryValueAnalysis.test_pfa_cas_boundary_lower_threshold _______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001ADAF400AA0>
    def test_pfa_cas_boundary_lower_threshold(self):
        """Boundary: exactly at lower CAS threshold"""
        threshold = 12 * 3300  # 39600
        venit = threshold
        pfa = PFACalculator(venit, 2024).calculate()
        expected_cas = 12 * 3300 * 0.25  # lower_base_multiplier * minimum_wage * cas_rate
>       assert pfa["cas"] == expected_cas
E       assert 0.0 == 9900.0
tests\test_boundary_values.py:109: AssertionError
=========================== short test summary info ============

28 : Job ID 71ae2b1c001f456caafade5a34569962
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 47), end pos: (42, 48)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil * cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
.............................................F
================================== FAILURES ===================================
______ TestEquivalencePartitioning.test_venit_brut_valid_large_positive _______
self = <test_equivalence_partitioning.TestEquivalencePartitioning object at 0x000001536688F230>
    def test_venit_brut_valid_large_positive(self):
        """Test valid equivalence class: large positive venit_brut"""
        # Large income, above all thresholds
        venit = 500000  # Much larger than 60 * 3300 = 198000
        employee = EmployeeCalculator(venit, 2024).calculate()
        assert employee["venit_net"] > 0
        assert employee["total_taxe"] > 0
        pfa = PFACalculator(venit, 2024).calculate()
>       assert

29 : Job ID 52e5be6132624952a8bd3e19f2939226
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 53), end pos: (42, 54)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil - cas * cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
..............................................................F
================================== FAILURES ===================================
____________ TestStatementCoverage.test_pfa_calculate_normal_case _____________
self = <test_statement_coverage.TestStatementCoverage object at 0x000002EF6B32ECF0>
    def test_pfa_calculate_normal_case(self):
        """Cover normal PFA calculation"""
        calc = PFACalculator(120000, 2024)
        result = calc.calculate()
        assert result["cas"] == 19800.0
        assert result["cass"] == 7920.0
>       assert result["impozit"] == 9228.0
E       assert 0.0 == 9228.0
tests\test_statement_coverage.py:73: AssertionError
=========================== short test summary info ================

31 : Job ID 3ac8a6d57c9e4d9bba943dedfa5dd68e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (34, 50), end pos: (34, 51)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -31,7 +31,7 @@
         cheltuieli = self.venit_brut * expense_ratio
         # Current model uses a configurable flat expense ratio.
-        venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
+        venit_net_impozabil = max(self.venit_brut / cheltuieli, 0.0)
         cas_base = self._get_cas_base(venit_net_impozabil)
         cas = cas_base * pfa_rules["cas_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001D4190BE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001D41905EF10>
    def calculate(self) -> Dict[str, float]:

32 : Job ID 31947fe2e03640be9610f2b143d7b5aa
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 47), end pos: (42, 48)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil / cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001C51405A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001C513FFEF10>
    def calculate(

33 : Job ID e7275ce3c56045c5982cc55372a03c86
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 53), end pos: (42, 54)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil - cas / cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001AD0AAEA350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001AD0AA8EF10>
    def calculate(

35 : Job ID a718afbf96ae4c5aabaafac215ad14fb
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (34, 50), end pos: (34, 51)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -31,7 +31,7 @@
         cheltuieli = self.venit_brut * expense_ratio
         # Current model uses a configurable flat expense ratio.
-        venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
+        venit_net_impozabil = max(self.venit_brut // cheltuieli, 0.0)
         cas_base = self._get_cas_base(venit_net_impozabil)
         cas = cas_base * pfa_rules["cas_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000024B9624A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000024B961EAF10>
    def calculate(self) -> Dict[str, flo

36 : Job ID f4d3afd8082548f8afcec942a7b49ce6
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 47), end pos: (42, 48)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil // cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000029E8DD7E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000029E8DD1EF10>
    def calc

37 : Job ID e4a65b46707d40bcaa0a2b0a5a7a45a6
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 53), end pos: (42, 54)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil - cas // cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001FE7A7DA350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001FE7A77EF10>
    def calc

39 : Job ID 2908ac7c3cd8461a8e4fe4c214ea8ebc
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (34, 50), end pos: (34, 51)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -31,7 +31,7 @@
         cheltuieli = self.venit_brut * expense_ratio
         # Current model uses a configurable flat expense ratio.
-        venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
+        venit_net_impozabil = max(self.venit_brut % cheltuieli, 0.0)
         cas_base = self._get_cas_base(venit_net_impozabil)
         cas = cas_base * pfa_rules["cas_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001EB1492E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001EB148CEF10>
    def calculate(self) -> Dict[str, float]:

40 : Job ID 7be4655c38ee4826b94a5c5ffdb45802
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 47), end pos: (42, 48)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil % cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001C9612BE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001C96125EF10>
    def calculate(

41 : Job ID 2dc37e7bed2e484aba052948c366ffb4
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 53), end pos: (42, 54)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil - cas % cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002192405E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000021923FFEF10>
    def calculate(

43 : Job ID 647e87ab458845b2ba45b324ff52ed3d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (34, 50), end pos: (34, 51)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -31,7 +31,7 @@
         cheltuieli = self.venit_brut * expense_ratio
         # Current model uses a configurable flat expense ratio.
-        venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
+        venit_net_impozabil = max(self.venit_brut ** cheltuieli, 0.0)
         cas_base = self._get_cas_base(venit_net_impozabil)
         cas = cas_base * pfa_rules["cas_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001E7F2EDA350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
        pfa = PFACalculator(0, 2024).calculate()
>       assert pfa["venit_net"] == 0.0
E       assert -0.1 == 0.0
tests\test_boundary_values.py:32: AssertionError
=========================== short test summary info ===========================
FAILED tests/test_boundary_values.py::TestBoundaryValueAnalysis::test_venit_brut_
