44 : Job ID b01e578193454268926e890ec1ebb31d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 47), end pos: (42, 48)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil ** cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002EFF9C7E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
        pfa = PFACalculator(0, 2024).calculate()
>       assert pfa["venit_net"] == 0.0
E       assert -0.1 == 0.0
tests\test_boundary_values.py:32: AssertionError
=========================== short test summary info ===========================
FAILED tests/test_boundary_values.py::TestBoundaryVal

45 : Job ID 9bb18030988a4c25a13e85a56282a4d4
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 53), end pos: (42, 54)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil - cas ** cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
...................F
================================== FAILURES ===================================
________ TestBoundaryValueAnalysis.test_anul_fiscal_boundary_min_year _________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002A748EF0050>
    def test_anul_fiscal_boundary_min_year(self):
        """Boundary: minimum available year"""
        min_year = min(get_available_years())
        employee = EmployeeCalculator(100000, min_year).calculate()
        assert "venit_net" in employee
>       pfa = PFACalculator(100000, min_year).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:56: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

47 : Job ID dad46006b9114b48bc299b6408d400cd
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (34, 50), end pos: (34, 51)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -31,7 +31,7 @@
         cheltuieli = self.venit_brut * expense_ratio
         # Current model uses a configurable flat expense ratio.
-        venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
+        venit_net_impozabil = max(self.venit_brut >> cheltuieli, 0.0)
         cas_base = self._get_cas_base(venit_net_impozabil)
         cas = cas_base * pfa_rules["cas_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000010E31D1A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000010E31CBAF10>
    def calculate(self) -> Dict[str, float

48 : Job ID a4f7f51d766f45b4acb8f9d4602c6b94
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 47), end pos: (42, 48)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil >> cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000150C9A1E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x00000150C99BEF10>
    def calcul

49 : Job ID f1ef0bdad9b1419c86c6dc90cefd103e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 53), end pos: (42, 54)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil - cas >> cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002003E99E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000002003E93EF10>
    def calcul

51 : Job ID 363323a8a37b488c8f2c7f0d5d974612
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (34, 50), end pos: (34, 51)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -31,7 +31,7 @@
         cheltuieli = self.venit_brut * expense_ratio
         # Current model uses a configurable flat expense ratio.
-        venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
+        venit_net_impozabil = max(self.venit_brut << cheltuieli, 0.0)
         cas_base = self._get_cas_base(venit_net_impozabil)
         cas = cas_base * pfa_rules["cas_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002910F84A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000002910F7EEF10>
    def calculate(self) -> Dict[str, float

52 : Job ID bd2db99be33c4f72bbdade8007bf410d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 47), end pos: (42, 48)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil << cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000023FF063E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000023FF05DEF10>
    def calcul

53 : Job ID 3556b26bca25436b9708470dc4d44792
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 53), end pos: (42, 54)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil - cas << cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002793956E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000002793950EF10>
    def calcul

55 : Job ID c6c70119c7eb46f2a8a3508657036f67
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (34, 50), end pos: (34, 51)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -31,7 +31,7 @@
         cheltuieli = self.venit_brut * expense_ratio
         # Current model uses a configurable flat expense ratio.
-        venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
+        venit_net_impozabil = max(self.venit_brut | cheltuieli, 0.0)
         cas_base = self._get_cas_base(venit_net_impozabil)
         cas = cas_base * pfa_rules["cas_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000015D1487A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000015D1481EF10>
    def calculate(self) -> Dict[str, float]:

56 : Job ID 6d17014e67d44f21a94f182f669fbb32
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 47), end pos: (42, 48)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil | cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001B161E4E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001B161DEEF10>
    def calculat

57 : Job ID 918e47dd3f604b179b53beb06ff36179
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 53), end pos: (42, 54)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil - cas | cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000027E12FBE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000027E12F5EF10>
    def calculat

59 : Job ID f01bb37150124dfc8b30dba12165ba5b
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (34, 50), end pos: (34, 51)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -31,7 +31,7 @@
         cheltuieli = self.venit_brut * expense_ratio
         # Current model uses a configurable flat expense ratio.
-        venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
+        venit_net_impozabil = max(self.venit_brut & cheltuieli, 0.0)
         cas_base = self._get_cas_base(venit_net_impozabil)
         cas = cas_base * pfa_rules["cas_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000220F036E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x00000220F030EF10>
    def calculate(self) -> Dict[str, float]

60 : Job ID 9e474682717743cf8686ecf05c1ca5a1
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 47), end pos: (42, 48)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil & cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001CFFAA8A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001CFFAA2EF10>
    def calcula

61 : Job ID 3ea4191797444f9b9643aa65d4d688ba
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 53), end pos: (42, 54)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil - cas & cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000211DA53E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x00000211DA4DAF10>
    def calcula

63 : Job ID f1ba5c1a1f394fb48bdecc5deeace8b8
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (34, 50), end pos: (34, 51)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -31,7 +31,7 @@
         cheltuieli = self.venit_brut * expense_ratio
         # Current model uses a configurable flat expense ratio.
-        venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
+        venit_net_impozabil = max(self.venit_brut ^ cheltuieli, 0.0)
         cas_base = self._get_cas_base(venit_net_impozabil)
         cas = cas_base * pfa_rules["cas_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002007BA0E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000002007B9A6F10>
    def calculate(self) -> Dict[str, float]

64 : Job ID 21c567e863f04583a573f5bcee51169f
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 47), end pos: (42, 48)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil ^ cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001FB278AE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001FB2784EF10>
    def calcula

65 : Job ID 2d23f6e7084c40fc8f8d9b711ba8ed16
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 53), end pos: (42, 54)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil - cas ^ cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001E892E0E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001E892DAEF10>
    def calcula

67 : Job ID 713572d6e258470981a941e67940d048
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (10, 56), end pos: (10, 57)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 0, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -7,7 +7,7 @@
     def _get_cas_base(self, venit_net_impozabil: float) -> float:
         # CAS base changes with thresholds expressed in minimum wages.
         cas_rules = self.rules["pfa"]["cas_thresholds"]
-        lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
+        lower_threshold = cas_rules["lower_multiplier"] + self.minimum_wage
         upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
         if venit_net_impozabil < lower_threshold:
.......F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_1_below_lower ________________
self = <test_basis_path.TestBasisPath object at 0x0000018584CCDE50>
    def test_cas_base_path_1_below_lower(self):
        """Path 1: Income is strictly below the lower threshold."""
        calc = PFACalculator(10000, 2024)
        # Threshold is 39600. Input 10000.
>       assert calc._get_cas_base(10000) == 0.0
E       assert 39600.0 == 0.0
E        +  where 39600.0 = _get_cas_base(10000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x0000018584CD57F0>.

68 : Job ID 035f6d8ed33d46b2b720fc0adf5a7ba4
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (11, 56), end pos: (11, 57)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 1, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -8,7 +8,7 @@
         # CAS base changes with thresholds expressed in minimum wages.
         cas_rules = self.rules["pfa"]["cas_thresholds"]
         lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
-        upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
+        upper_threshold = cas_rules["upper_multiplier"] + self.minimum_wage
         if venit_net_impozabil < lower_threshold:
             return 0.0
........F
================================== FAILURES ===================================
____________ TestBasisPath.test_cas_base_path_2_between_thresholds ____________
self = <test_basis_path.TestBasisPath object at 0x000001CC7008DF90>
    def test_cas_base_path_2_between_thresholds(self):
        """Path 2: Income is between the lower and upper thresholds."""
        calc = PFACalculator(50000, 2024)
        # Thresholds: 39600 and 79200. Input 50000.
        min_wage = 3300
>       assert calc._get_cas_base(50000) == 12 * min_wage
E       assert 79200.0 == (12 * 3300)
E        +  where 79200.0 = _get_cas_base(50000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at
