88 : Job ID cac87c573eeb421c9d84fdfff0c87f48
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (11, 56), end pos: (11, 57)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 1, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -8,7 +8,7 @@
         # CAS base changes with thresholds expressed in minimum wages.
         cas_rules = self.rules["pfa"]["cas_thresholds"]
         lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
-        upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
+        upper_threshold = cas_rules["upper_multiplier"] / self.minimum_wage
         if venit_net_impozabil < lower_threshold:
             return 0.0
........F
================================== FAILURES ===================================
____________ TestBasisPath.test_cas_base_path_2_between_thresholds ____________
self = <test_basis_path.TestBasisPath object at 0x000001426F26DF90>
    def test_cas_base_path_2_between_thresholds(self):
        """Path 2: Income is between the lower and upper thresholds."""
        calc = PFACalculator(50000, 2024)
        # Thresholds: 39600 and 79200. Input 50000.
        min_wage = 3300
>       assert calc._get_cas_base(50000) == 12 * min_wage
E       assert 79200.0 == (12 * 3300)
E        +  where 79200.0 = _get_cas_base(50000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at

89 : Job ID 8b8481d4e62843be8db447ed7e49adac
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (16, 54), end pos: (16, 55)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 2, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -13,7 +13,7 @@
         if venit_net_impozabil < lower_threshold:
             return 0.0
         if venit_net_impozabil < upper_threshold:
-            return cas_rules["lower_base_multiplier"] * self.minimum_wage
+            return cas_rules["lower_base_multiplier"] / self.minimum_wage
         return cas_rules["upper_base_multiplier"] * self.minimum_wage
     def _get_cass_base(self, venit_net_impozabil: float) -> float:
........F
================================== FAILURES ===================================
____________ TestBasisPath.test_cas_base_path_2_between_thresholds ____________
self = <test_basis_path.TestBasisPath object at 0x000002316D17DF90>
    def test_cas_base_path_2_between_thresholds(self):
        """Path 2: Income is between the lower and upper thresholds."""
        calc = PFACalculator(50000, 2024)
        # Thresholds: 39600 and 79200. Input 50000.
        min_wage = 3300
>       assert calc._get_cas_base(50000) == 12 * min_wage
E       assert 0.0036363636363636364 == (12 * 3300)
E        +  where 0.0036363636363636364 = _get_cas_base(50000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator

90 : Job ID a7d6aa94a194471f88afebe1ac44ee7a
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (17, 50), end pos: (17, 51)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 3, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -14,7 +14,7 @@
             return 0.0
         if venit_net_impozabil < upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
-        return cas_rules["upper_base_multiplier"] * self.minimum_wage
+        return cas_rules["upper_base_multiplier"] / self.minimum_wage
     def _get_cass_base(self, venit_net_impozabil: float) -> float:
         # CASS uses progressive brackets configured per fiscal year.
.........F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_3_above_upper ________________
self = <test_basis_path.TestBasisPath object at 0x0000024A559E29E0>
    def test_cas_base_path_3_above_upper(self):
        """Path 3: Income is exactly at or above the upper threshold."""
        calc = PFACalculator(100000, 2024)
        # Upper threshold is 79200. Input 100000.
        min_wage = 3300
>       assert calc._get_cas_base(100000) == 24 * min_wage
E       assert 0.007272727272727273 == (24 * 3300)
E        +  where 0.007272727272727273 = _get_cas_base(100000)
E        +    where _get_cas_base = <calculator_pfa.PFACa

91 : Job ID 7cc6ce129a714af49efc4c4561a20d0f
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (24, 61), end pos: (24, 62)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 4, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -21,7 +21,7 @@
         brackets = self.rules["pfa"]["cass_brackets"]
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
-            if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
+            if upper is None or venit_net_impozabil <= upper / self.minimum_wage:
                 return bracket["base_multiplier"] * self.minimum_wage
         return 0.0
.................F
================================== FAILURES ===================================
_____ TestBoundaryValueAnalysis.test_venit_brut_boundary_just_above_zero ______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002533EF42B10>
    def test_venit_brut_boundary_just_above_zero(self):
        """Boundary: just above zero"""
        employee = EmployeeCalculator(0.01, 2024).calculate()
        assert employee["venit_net"] > 0
        pfa = PFACalculator(0.01, 2024).calculate()
>       assert pfa["venit_net"] > 0
E       assert -7919.99 > 0
tests\test_boundary_values.py:40: AssertionError
=========================== short test summary info ===========================
FAILED test

92 : Job ID f148098662ad4635a4cb00d63b21c23f
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (25, 50), end pos: (25, 51)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 5, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -22,7 +22,7 @@
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
             if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
-                return bracket["base_multiplier"] * self.minimum_wage
+                return bracket["base_multiplier"] / self.minimum_wage
         return 0.0
     def calculate(self) -> Dict[str, float]:
..............................F
================================== FAILURES ===================================
____ TestBoundaryValueAnalysis.test_pfa_cass_boundary_bracket_transitions _____
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000026B3CBB4050>
    def test_pfa_cass_boundary_bracket_transitions(self):
        """Boundary values at CASS bracket transitions"""
        brackets = [
            (6 * 3300 - 1, 0),      # Just below first bracket
            (6 * 3300, 0),          # At first bracket boundary
            (6 * 3300 + 1, 6 * 3300), # Just above first bracket
            (12 * 3300 - 1, 6 * 3300), # Just below second bracket
            (12 * 3300, 6 * 3300), # At second bracket boundary

93 : Job ID 8ec9afa486654c649156ca6646086a6b
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (32, 37), end pos: (32, 38)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 6, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -29,7 +29,7 @@
         pfa_rules = self.rules["pfa"]
         expense_ratio = pfa_rules.get("expense_ratio", 0.0)
-        cheltuieli = self.venit_brut * expense_ratio
+        cheltuieli = self.venit_brut / expense_ratio
         # Current model uses a configurable flat expense ratio.
         venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000026216DCE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000026216D66F10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self.

94 : Job ID e6a5148c24bc49fa97a0faf9e119b40e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (37, 23), end pos: (37, 24)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 7, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -34,7 +34,7 @@
         venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
         cas_base = self._get_cas_base(venit_net_impozabil)
-        cas = cas_base * pfa_rules["cas_rate"]
+        cas = cas_base / pfa_rules["cas_rate"]
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
.........................F
================================== FAILURES ===================================
_______ TestBoundaryValueAnalysis.test_pfa_cas_boundary_lower_threshold _______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001DCAFA10AA0>
    def test_pfa_cas_boundary_lower_threshold(self):
        """Boundary: exactly at lower CAS threshold"""
        threshold = 12 * 3300  # 39600
        venit = threshold
        pfa = PFACalculator(venit, 2024).calculate()
        expected_cas = 12 * 3300 * 0.25  # lower_base_multiplier * minimum_wage * cas_rate
>       assert pfa["cas"] == expected_cas
E       assert 158400.0 == 9900.0
tests\test_boundary_values.py:109: AssertionError
=========================== short test summary info ===========================
FAILED

95 : Job ID ba5c1fe494784f42b0cd7d7242b1ff33
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (40, 25), end pos: (40, 26)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 8, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -37,7 +37,7 @@
         cas = cas_base * pfa_rules["cas_rate"]
         cass_base = self._get_cass_base(venit_net_impozabil)
-        cass = cass_base * pfa_rules["cass_rate"]
+        cass = cass_base / pfa_rules["cass_rate"]
         baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
..............................F
================================== FAILURES ===================================
____ TestBoundaryValueAnalysis.test_pfa_cass_boundary_bracket_transitions _____
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001D4F5314050>
    def test_pfa_cass_boundary_bracket_transitions(self):
        """Boundary values at CASS bracket transitions"""
        brackets = [
            (6 * 3300 - 1, 0),      # Just below first bracket
            (6 * 3300, 0),          # At first bracket boundary
            (6 * 3300 + 1, 6 * 3300), # Just above first bracket
            (12 * 3300 - 1, 6 * 3300), # Just below second bracket
            (12 * 3300, 6 * 3300), # At second bracket boundary
            (12 * 3300 + 1, 12 * 3300),

96 : Job ID 2aa0276ea0394740af67a12ba1c4ef8e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (44, 31), end pos: (44, 32)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 9, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -41,7 +41,7 @@
         baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
-        impozit = baza_impozit * pfa_rules["income_tax_rate"]
+        impozit = baza_impozit / pfa_rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
.................F
================================== FAILURES ===================================
_____ TestBoundaryValueAnalysis.test_venit_brut_boundary_just_above_zero ______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000027BAA8AEB10>
    def test_venit_brut_boundary_just_above_zero(self):
        """Boundary: just above zero"""
        employee = EmployeeCalculator(0.01, 2024).calculate()
        assert employee["venit_net"] > 0
        pfa = PFACalculator(0.01, 2024).calculate()
>       assert pfa["venit_net"] > 0
E       assert -0.09 > 0
tests\test_boundary_values.py:40: AssertionError
=========================== short test summary info ===========================
FAILED tests/test_boundary_values.py::TestBoundaryValueAnalysis::

97 : Job ID 5b704fe94e9e49b7a08556bb9d38c6fb
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (10, 56), end pos: (10, 57)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 0, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -7,7 +7,7 @@
     def _get_cas_base(self, venit_net_impozabil: float) -> float:
         # CAS base changes with thresholds expressed in minimum wages.
         cas_rules = self.rules["pfa"]["cas_thresholds"]
-        lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
+        lower_threshold = cas_rules["lower_multiplier"] // self.minimum_wage
         upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
         if venit_net_impozabil < lower_threshold:
.......F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_1_below_lower ________________
self = <test_basis_path.TestBasisPath object at 0x000001C0214ADE50>
    def test_cas_base_path_1_below_lower(self):
        """Path 1: Income is strictly below the lower threshold."""
        calc = PFACalculator(10000, 2024)
        # Threshold is 39600. Input 10000.
>       assert calc._get_cas_base(10000) == 0.0
E       assert 39600.0 == 0.0
E        +  where 39600.0 = _get_cas_base(10000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x000001C0214B

98 : Job ID 541b04e072764d55a666b8d1d3f3a306
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (11, 56), end pos: (11, 57)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 1, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -8,7 +8,7 @@
         # CAS base changes with thresholds expressed in minimum wages.
         cas_rules = self.rules["pfa"]["cas_thresholds"]
         lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
-        upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
+        upper_threshold = cas_rules["upper_multiplier"] // self.minimum_wage
         if venit_net_impozabil < lower_threshold:
             return 0.0
........F
================================== FAILURES ===================================
____________ TestBasisPath.test_cas_base_path_2_between_thresholds ____________
self = <test_basis_path.TestBasisPath object at 0x0000014D2376DF90>
    def test_cas_base_path_2_between_thresholds(self):
        """Path 2: Income is between the lower and upper thresholds."""
        calc = PFACalculator(50000, 2024)
        # Thresholds: 39600 and 79200. Input 50000.
        min_wage = 3300
>       assert calc._get_cas_base(50000) == 12 * min_wage
E       assert 79200.0 == (12 * 3300)
E        +  where 79200.0 = _get_cas_base(50000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator obje

99 : Job ID e4a10ee8062a432f89507bfe2d409ce1
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (16, 54), end pos: (16, 55)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 2, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -13,7 +13,7 @@
         if venit_net_impozabil < lower_threshold:
             return 0.0
         if venit_net_impozabil < upper_threshold:
-            return cas_rules["lower_base_multiplier"] * self.minimum_wage
+            return cas_rules["lower_base_multiplier"] // self.minimum_wage
         return cas_rules["upper_base_multiplier"] * self.minimum_wage
     def _get_cass_base(self, venit_net_impozabil: float) -> float:
........F
================================== FAILURES ===================================
____________ TestBasisPath.test_cas_base_path_2_between_thresholds ____________
self = <test_basis_path.TestBasisPath object at 0x0000024CBC87DF90>
    def test_cas_base_path_2_between_thresholds(self):
        """Path 2: Income is between the lower and upper thresholds."""
        calc = PFACalculator(50000, 2024)
        # Thresholds: 39600 and 79200. Input 50000.
        min_wage = 3300
>       assert calc._get_cas_base(50000) == 12 * min_wage
E       assert 0.0 == (12 * 3300)
E        +  where 0.0 = _get_cas_base(50000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x0000024CBC87DD10>.

100 : Job ID 490015483a374e9396c55514b9785f13
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (17, 50), end pos: (17, 51)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 3, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -14,7 +14,7 @@
             return 0.0
         if venit_net_impozabil < upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
-        return cas_rules["upper_base_multiplier"] * self.minimum_wage
+        return cas_rules["upper_base_multiplier"] // self.minimum_wage
     def _get_cass_base(self, venit_net_impozabil: float) -> float:
         # CASS uses progressive brackets configured per fiscal year.
.........F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_3_above_upper ________________
self = <test_basis_path.TestBasisPath object at 0x000001E2A918E9E0>
    def test_cas_base_path_3_above_upper(self):
        """Path 3: Income is exactly at or above the upper threshold."""
        calc = PFACalculator(100000, 2024)
        # Upper threshold is 79200. Input 100000.
        min_wage = 3300
>       assert calc._get_cas_base(100000) == 24 * min_wage
E       assert 0.0 == (24 * 3300)
E        +  where 0.0 = _get_cas_base(100000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x000001

101 : Job ID de7b02562f934415a3faaed7ff21e3f3
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (24, 61), end pos: (24, 62)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 4, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -21,7 +21,7 @@
         brackets = self.rules["pfa"]["cass_brackets"]
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
-            if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
+            if upper is None or venit_net_impozabil <= upper // self.minimum_wage:
                 return bracket["base_multiplier"] * self.minimum_wage
         return 0.0
.................F
================================== FAILURES ===================================
_____ TestBoundaryValueAnalysis.test_venit_brut_boundary_just_above_zero ______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000029F8E11EB10>
    def test_venit_brut_boundary_just_above_zero(self):
        """Boundary: just above zero"""
        employee = EmployeeCalculator(0.01, 2024).calculate()
        assert employee["venit_net"] > 0
        pfa = PFACalculator(0.01, 2024).calculate()
>       assert pfa["venit_net"] > 0
E       assert -19799.99 > 0
tests\test_boundary_values.py:40: AssertionError
=========================== short test summary info ===========================
FAI

102 : Job ID 401a9f5cc7fa48409e8898221a9f1caf
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (25, 50), end pos: (25, 51)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 5, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -22,7 +22,7 @@
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
             if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
-                return bracket["base_multiplier"] * self.minimum_wage
+                return bracket["base_multiplier"] // self.minimum_wage
         return 0.0
     def calculate(self) -> Dict[str, float]:
..............................F
================================== FAILURES ===================================
____ TestBoundaryValueAnalysis.test_pfa_cass_boundary_bracket_transitions _____
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001D2DE7F4050>
    def test_pfa_cass_boundary_bracket_transitions(self):
        """Boundary values at CASS bracket transitions"""
        brackets = [
            (6 * 3300 - 1, 0),      # Just below first bracket
            (6 * 3300, 0),          # At first bracket boundary
            (6 * 3300 + 1, 6 * 3300), # Just above first bracket
            (12 * 3300 - 1, 6 * 3300), # Just below second bracket
            (12 * 3300, 6 * 3300), # At second bracket bound

103 : Job ID 18529e985d5440ba8389ce2dbb978057
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (32, 37), end pos: (32, 38)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 6, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -29,7 +29,7 @@
         pfa_rules = self.rules["pfa"]
         expense_ratio = pfa_rules.get("expense_ratio", 0.0)
-        cheltuieli = self.venit_brut * expense_ratio
+        cheltuieli = self.venit_brut // expense_ratio
         # Current model uses a configurable flat expense ratio.
         venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001A080E2E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001A080DCEF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules

104 : Job ID 76b15196e4874fa39720031ca51b28c9
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (37, 23), end pos: (37, 24)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 7, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -34,7 +34,7 @@
         venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
         cas_base = self._get_cas_base(venit_net_impozabil)
-        cas = cas_base * pfa_rules["cas_rate"]
+        cas = cas_base // pfa_rules["cas_rate"]
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
.........................F
================================== FAILURES ===================================
_______ TestBoundaryValueAnalysis.test_pfa_cas_boundary_lower_threshold _______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000025066070AA0>
    def test_pfa_cas_boundary_lower_threshold(self):
        """Boundary: exactly at lower CAS threshold"""
        threshold = 12 * 3300  # 39600
        venit = threshold
        pfa = PFACalculator(venit, 2024).calculate()
        expected_cas = 12 * 3300 * 0.25  # lower_base_multiplier * minimum_wage * cas_rate
>       assert pfa["cas"] == expected_cas
E       assert 158400.0 == 9900.0
tests\test_boundary_values.py:109: AssertionError
=========================== short test summary info ===========================

105 : Job ID defc32028dd24540a03d957505cd1982
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (40, 25), end pos: (40, 26)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 8, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -37,7 +37,7 @@
         cas = cas_base * pfa_rules["cas_rate"]
         cass_base = self._get_cass_base(venit_net_impozabil)
-        cass = cass_base * pfa_rules["cass_rate"]
+        cass = cass_base // pfa_rules["cass_rate"]
         baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
..............................F
================================== FAILURES ===================================
____ TestBoundaryValueAnalysis.test_pfa_cass_boundary_bracket_transitions _____
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001AA716D4050>
    def test_pfa_cass_boundary_bracket_transitions(self):
        """Boundary values at CASS bracket transitions"""
        brackets = [
            (6 * 3300 - 1, 0),      # Just below first bracket
            (6 * 3300, 0),          # At first bracket boundary
            (6 * 3300 + 1, 6 * 3300), # Just above first bracket
            (12 * 3300 - 1, 6 * 3300), # Just below second bracket
            (12 * 3300, 6 * 3300), # At second bracket boundary
            (12 * 3300 + 1, 12 *

106 : Job ID aca90b727291440999778eb575122b86
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (44, 31), end pos: (44, 32)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 9, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -41,7 +41,7 @@
         baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
-        impozit = baza_impozit * pfa_rules["income_tax_rate"]
+        impozit = baza_impozit // pfa_rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
............................................F
================================== FAILURES ===================================
______ TestEquivalencePartitioning.test_venit_brut_valid_small_positive _______
self = <test_equivalence_partitioning.TestEquivalencePartitioning object at 0x000001E4DFEBF490>
    def test_venit_brut_valid_small_positive(self):
        """Test valid equivalence class: small positive venit_brut"""
        # Small income, below minimum wage thresholds
        venit = 10000  # Less than 12 * 3300 = 39600 for 2024
        employee = EmployeeCalculator(venit, 2024).calculate()
        assert employee["venit_net"] > 0
        assert employee["total_taxe"] > 0
        pfa = PFACalculator(venit, 2024).calculate()
>       assert pfa["veni
