107 : Job ID 9b3bfad7536a4c0b844e55a1de043db1
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (10, 56), end pos: (10, 57)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 0, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -7,7 +7,7 @@
     def _get_cas_base(self, venit_net_impozabil: float) -> float:
         # CAS base changes with thresholds expressed in minimum wages.
         cas_rules = self.rules["pfa"]["cas_thresholds"]
-        lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
+        lower_threshold = cas_rules["lower_multiplier"] % self.minimum_wage
         upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
         if venit_net_impozabil < lower_threshold:
.......F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_1_below_lower ________________
self = <test_basis_path.TestBasisPath object at 0x00000258A3EBDE50>
    def test_cas_base_path_1_below_lower(self):
        """Path 1: Income is strictly below the lower threshold."""
        calc = PFACalculator(10000, 2024)
        # Threshold is 39600. Input 10000.
>       assert calc._get_cas_base(10000) == 0.0
E       assert 39600.0 == 0.0
E        +  where 39600.0 = _get_cas_base(10000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x00000258A3EC57F0>

108 : Job ID 728f0c2eb8714a54b2e18d09dc5a1dae
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (11, 56), end pos: (11, 57)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 1, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -8,7 +8,7 @@
         # CAS base changes with thresholds expressed in minimum wages.
         cas_rules = self.rules["pfa"]["cas_thresholds"]
         lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
-        upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
+        upper_threshold = cas_rules["upper_multiplier"] % self.minimum_wage
         if venit_net_impozabil < lower_threshold:
             return 0.0
........F
================================== FAILURES ===================================
____________ TestBasisPath.test_cas_base_path_2_between_thresholds ____________
self = <test_basis_path.TestBasisPath object at 0x0000024F2A3CDF90>
    def test_cas_base_path_2_between_thresholds(self):
        """Path 2: Income is between the lower and upper thresholds."""
        calc = PFACalculator(50000, 2024)
        # Thresholds: 39600 and 79200. Input 50000.
        min_wage = 3300
>       assert calc._get_cas_base(50000) == 12 * min_wage
E       assert 79200.0 == (12 * 3300)
E        +  where 79200.0 = _get_cas_base(50000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at

109 : Job ID d1654f3b9eb64f659432f3d5702d9a0e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (16, 54), end pos: (16, 55)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 2, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -13,7 +13,7 @@
         if venit_net_impozabil < lower_threshold:
             return 0.0
         if venit_net_impozabil < upper_threshold:
-            return cas_rules["lower_base_multiplier"] * self.minimum_wage
+            return cas_rules["lower_base_multiplier"] % self.minimum_wage
         return cas_rules["upper_base_multiplier"] * self.minimum_wage
     def _get_cass_base(self, venit_net_impozabil: float) -> float:
........F
================================== FAILURES ===================================
____________ TestBasisPath.test_cas_base_path_2_between_thresholds ____________
self = <test_basis_path.TestBasisPath object at 0x0000017C8D419F90>
    def test_cas_base_path_2_between_thresholds(self):
        """Path 2: Income is between the lower and upper thresholds."""
        calc = PFACalculator(50000, 2024)
        # Thresholds: 39600 and 79200. Input 50000.
        min_wage = 3300
>       assert calc._get_cas_base(50000) == 12 * min_wage
E       assert 12.0 == (12 * 3300)
E        +  where 12.0 = _get_cas_base(50000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x0000017C8D419D10>._ge

110 : Job ID 4416c87a39d347799e83be75d3de8d58
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (17, 50), end pos: (17, 51)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 3, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -14,7 +14,7 @@
             return 0.0
         if venit_net_impozabil < upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
-        return cas_rules["upper_base_multiplier"] * self.minimum_wage
+        return cas_rules["upper_base_multiplier"] % self.minimum_wage
     def _get_cass_base(self, venit_net_impozabil: float) -> float:
         # CASS uses progressive brackets configured per fiscal year.
.........F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_3_above_upper ________________
self = <test_basis_path.TestBasisPath object at 0x000001BCD41329E0>
    def test_cas_base_path_3_above_upper(self):
        """Path 3: Income is exactly at or above the upper threshold."""
        calc = PFACalculator(100000, 2024)
        # Upper threshold is 79200. Input 100000.
        min_wage = 3300
>       assert calc._get_cas_base(100000) == 24 * min_wage
E       assert 24.0 == (24 * 3300)
E        +  where 24.0 = _get_cas_base(100000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x000001BCD4

111 : Job ID 0464fbc03b0447c393a2c3efa90d2248
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (24, 61), end pos: (24, 62)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 4, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -21,7 +21,7 @@
         brackets = self.rules["pfa"]["cass_brackets"]
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
-            if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
+            if upper is None or venit_net_impozabil <= upper % self.minimum_wage:
                 return bracket["base_multiplier"] * self.minimum_wage
         return 0.0
..............................F
================================== FAILURES ===================================
____ TestBoundaryValueAnalysis.test_pfa_cass_boundary_bracket_transitions _____
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000200D8324050>
    def test_pfa_cass_boundary_bracket_transitions(self):
        """Boundary values at CASS bracket transitions"""
        brackets = [
            (6 * 3300 - 1, 0),      # Just below first bracket
            (6 * 3300, 0),          # At first bracket boundary
            (6 * 3300 + 1, 6 * 3300), # Just above first bracket
            (12 * 3300 - 1, 6 * 3300), # Just below second bracket
            (12 * 3300, 6 * 3300), # At secon

112 : Job ID 61f6c2ae456d4dee804692b882a993d3
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (25, 50), end pos: (25, 51)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 5, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -22,7 +22,7 @@
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
             if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
-                return bracket["base_multiplier"] * self.minimum_wage
+                return bracket["base_multiplier"] % self.minimum_wage
         return 0.0
     def calculate(self) -> Dict[str, float]:
..............................F
================================== FAILURES ===================================
____ TestBoundaryValueAnalysis.test_pfa_cass_boundary_bracket_transitions _____
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001B4BAC84050>
    def test_pfa_cass_boundary_bracket_transitions(self):
        """Boundary values at CASS bracket transitions"""
        brackets = [
            (6 * 3300 - 1, 0),      # Just below first bracket
            (6 * 3300, 0),          # At first bracket boundary
            (6 * 3300 + 1, 6 * 3300), # Just above first bracket
            (12 * 3300 - 1, 6 * 3300), # Just below second bracket
            (12 * 3300, 6 * 3300), # At second bracket boundary

113 : Job ID 4a04a7b20bb141d5a8011117279a7600
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (32, 37), end pos: (32, 38)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 6, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -29,7 +29,7 @@
         pfa_rules = self.rules["pfa"]
         expense_ratio = pfa_rules.get("expense_ratio", 0.0)
-        cheltuieli = self.venit_brut * expense_ratio
+        cheltuieli = self.venit_brut % expense_ratio
         # Current model uses a configurable flat expense ratio.
         venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000298A163E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x00000298A15D6F10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self

114 : Job ID c737a622f5804bffa98e4a7e4fd7c4d0
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (37, 23), end pos: (37, 24)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 7, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -34,7 +34,7 @@
         venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
         cas_base = self._get_cas_base(venit_net_impozabil)
-        cas = cas_base * pfa_rules["cas_rate"]
+        cas = cas_base % pfa_rules["cas_rate"]
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
.........................F
================================== FAILURES ===================================
_______ TestBoundaryValueAnalysis.test_pfa_cas_boundary_lower_threshold _______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001BBD6E50AA0>
    def test_pfa_cas_boundary_lower_threshold(self):
        """Boundary: exactly at lower CAS threshold"""
        threshold = 12 * 3300  # 39600
        venit = threshold
        pfa = PFACalculator(venit, 2024).calculate()
        expected_cas = 12 * 3300 * 0.25  # lower_base_multiplier * minimum_wage * cas_rate
>       assert pfa["cas"] == expected_cas
E       assert 0.0 == 9900.0
tests\test_boundary_values.py:109: AssertionError
=========================== short test summary info ===========================
FAILED test

115 : Job ID 53323be8e02d46699828b03106abb239
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (40, 25), end pos: (40, 26)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 8, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -37,7 +37,7 @@
         cas = cas_base * pfa_rules["cas_rate"]
         cass_base = self._get_cass_base(venit_net_impozabil)
-        cass = cass_base * pfa_rules["cass_rate"]
+        cass = cass_base % pfa_rules["cass_rate"]
         baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
..............................F
================================== FAILURES ===================================
____ TestBoundaryValueAnalysis.test_pfa_cass_boundary_bracket_transitions _____
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000017CC7044050>
    def test_pfa_cass_boundary_bracket_transitions(self):
        """Boundary values at CASS bracket transitions"""
        brackets = [
            (6 * 3300 - 1, 0),      # Just below first bracket
            (6 * 3300, 0),          # At first bracket boundary
            (6 * 3300 + 1, 6 * 3300), # Just above first bracket
            (12 * 3300 - 1, 6 * 3300), # Just below second bracket
            (12 * 3300, 6 * 3300), # At second bracket boundary
            (12 * 3300 + 1, 12 * 3300),

116 : Job ID 117766c00a7d40c495be0ec066c91804
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (44, 31), end pos: (44, 32)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 9, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -41,7 +41,7 @@
         baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
-        impozit = baza_impozit * pfa_rules["income_tax_rate"]
+        impozit = baza_impozit % pfa_rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
.................F
================================== FAILURES ===================================
_____ TestBoundaryValueAnalysis.test_venit_brut_boundary_just_above_zero ______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000025C5CFEAB10>
    def test_venit_brut_boundary_just_above_zero(self):
        """Boundary: just above zero"""
        employee = EmployeeCalculator(0.01, 2024).calculate()
        assert employee["venit_net"] > 0
        pfa = PFACalculator(0.01, 2024).calculate()
>       assert pfa["venit_net"] > 0
E       assert 0.0 > 0
tests\test_boundary_values.py:40: AssertionError
=========================== short test summary info ===========================
FAILED tests/test_boundary_values.py::TestBoundaryValueAnalysis::t

117 : Job ID 54c66183748d4263a2e7aa5bc53c417b
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (10, 56), end pos: (10, 57)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 0, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -7,7 +7,7 @@
     def _get_cas_base(self, venit_net_impozabil: float) -> float:
         # CAS base changes with thresholds expressed in minimum wages.
         cas_rules = self.rules["pfa"]["cas_thresholds"]
-        lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
+        lower_threshold = cas_rules["lower_multiplier"] ** self.minimum_wage
         upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
         if venit_net_impozabil < lower_threshold:
.......F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_1_below_lower ________________
self = <test_basis_path.TestBasisPath object at 0x0000015D145BDE50>
    def test_cas_base_path_1_below_lower(self):
        """Path 1: Income is strictly below the lower threshold."""
        calc = PFACalculator(10000, 2024)
        # Threshold is 39600. Input 10000.
>       assert calc._get_cas_base(10000) == 0.0
               ^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa

118 : Job ID e209074129774275b1c4725ffb62c462
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (11, 56), end pos: (11, 57)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 1, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -8,7 +8,7 @@
         # CAS base changes with thresholds expressed in minimum wages.
         cas_rules = self.rules["pfa"]["cas_thresholds"]
         lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
-        upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
+        upper_threshold = cas_rules["upper_multiplier"] ** self.minimum_wage
         if venit_net_impozabil < lower_threshold:
             return 0.0
.......F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_1_below_lower ________________
self = <test_basis_path.TestBasisPath object at 0x000001CE57E0DE50>
    def test_cas_base_path_1_below_lower(self):
        """Path 1: Income is strictly below the lower threshold."""
        calc = PFACalculator(10000, 2024)
        # Threshold is 39600. Input 10000.
>       assert calc._get_cas_base(10000) == 0.0
               ^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001CE57E157F0

119 : Job ID e0644bec40af4d648927f4cb84110b2f
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (16, 54), end pos: (16, 55)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 2, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -13,7 +13,7 @@
         if venit_net_impozabil < lower_threshold:
             return 0.0
         if venit_net_impozabil < upper_threshold:
-            return cas_rules["lower_base_multiplier"] * self.minimum_wage
+            return cas_rules["lower_base_multiplier"] ** self.minimum_wage
         return cas_rules["upper_base_multiplier"] * self.minimum_wage
     def _get_cass_base(self, venit_net_impozabil: float) -> float:
........F
================================== FAILURES ===================================
____________ TestBasisPath.test_cas_base_path_2_between_thresholds ____________
self = <test_basis_path.TestBasisPath object at 0x00000228AE16DF90>
    def test_cas_base_path_2_between_thresholds(self):
        """Path 2: Income is between the lower and upper thresholds."""
        calc = PFACalculator(50000, 2024)
        # Thresholds: 39600 and 79200. Input 50000.
        min_wage = 3300
>       assert calc._get_cas_base(50000) == 12 * min_wage
               ^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:35: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACa

120 : Job ID d99b70e66b4847e39b1fac4273456ac2
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (17, 50), end pos: (17, 51)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 3, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -14,7 +14,7 @@
             return 0.0
         if venit_net_impozabil < upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
-        return cas_rules["upper_base_multiplier"] * self.minimum_wage
+        return cas_rules["upper_base_multiplier"] ** self.minimum_wage
     def _get_cass_base(self, venit_net_impozabil: float) -> float:
         # CASS uses progressive brackets configured per fiscal year.
.........F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_3_above_upper ________________
self = <test_basis_path.TestBasisPath object at 0x000002087739E9E0>
    def test_cas_base_path_3_above_upper(self):
        """Path 3: Income is exactly at or above the upper threshold."""
        calc = PFACalculator(100000, 2024)
        # Upper threshold is 79200. Input 100000.
        min_wage = 3300
>       assert calc._get_cas_base(100000) == 24 * min_wage
               ^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:42: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculato

121 : Job ID 07c74ef9730b407c85f27561438f7f20
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (24, 61), end pos: (24, 62)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 4, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -21,7 +21,7 @@
         brackets = self.rules["pfa"]["cass_brackets"]
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
-            if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
+            if upper is None or venit_net_impozabil <= upper ** self.minimum_wage:
                 return bracket["base_multiplier"] * self.minimum_wage
         return 0.0
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001EBE1E0A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
src\calculator_pfa.py:39: in calculate
    cass_base = s

122 : Job ID 4aee9181453640fbbc76bdd59ff45603
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (25, 50), end pos: (25, 51)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 5, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -22,7 +22,7 @@
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
             if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
-                return bracket["base_multiplier"] * self.minimum_wage
+                return bracket["base_multiplier"] ** self.minimum_wage
         return 0.0
     def calculate(self) -> Dict[str, float]:
...................F
================================== FAILURES ===================================
________ TestBoundaryValueAnalysis.test_anul_fiscal_boundary_min_year _________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001F271710050>
    def test_anul_fiscal_boundary_min_year(self):
        """Boundary: minimum available year"""
        min_year = min(get_available_years())
        employee = EmployeeCalculator(100000, min_year).calculate()
        assert "venit_net" in employee
>       pfa = PFACalculator(100000, min_year).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:56: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

123 : Job ID 389503821eab418cbbfa50fc5b624e15
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (32, 37), end pos: (32, 38)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 6, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -29,7 +29,7 @@
         pfa_rules = self.rules["pfa"]
         expense_ratio = pfa_rules.get("expense_ratio", 0.0)
-        cheltuieli = self.venit_brut * expense_ratio
+        cheltuieli = self.venit_brut ** expense_ratio
         # Current model uses a configurable flat expense ratio.
         venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
.........................F
================================== FAILURES ===================================
_______ TestBoundaryValueAnalysis.test_pfa_cas_boundary_lower_threshold _______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000020B4CD00AA0>
    def test_pfa_cas_boundary_lower_threshold(self):
        """Boundary: exactly at lower CAS threshold"""
        threshold = 12 * 3300  # 39600
        venit = threshold
        pfa = PFACalculator(venit, 2024).calculate()
        expected_cas = 12 * 3300 * 0.25  # lower_base_multiplier * minimum_wage * cas_rate
>       assert pfa["cas"] == expected_cas
E       assert 0.0 == 9900.0
tests\test_boundary_values.py:109: AssertionError
=========================== short test summary info ===========================
FAILED

124 : Job ID 44f30f81d17f409099c2d5ea3e5468a2
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (37, 23), end pos: (37, 24)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 7, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -34,7 +34,7 @@
         venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
         cas_base = self._get_cas_base(venit_net_impozabil)
-        cas = cas_base * pfa_rules["cas_rate"]
+        cas = cas_base ** pfa_rules["cas_rate"]
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
.........................F
================================== FAILURES ===================================
_______ TestBoundaryValueAnalysis.test_pfa_cas_boundary_lower_threshold _______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000023B0C5D0AA0>
    def test_pfa_cas_boundary_lower_threshold(self):
        """Boundary: exactly at lower CAS threshold"""
        threshold = 12 * 3300  # 39600
        venit = threshold
        pfa = PFACalculator(venit, 2024).calculate()
        expected_cas = 12 * 3300 * 0.25  # lower_base_multiplier * minimum_wage * cas_rate
>       assert pfa["cas"] == expected_cas
E       assert 14.11 == 9900.0
tests\test_boundary_values.py:109: AssertionError
=========================== short test summary info ===========================
FAILED t

125 : Job ID 377e417de277446a90cc84bc969ea88f
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (40, 25), end pos: (40, 26)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 8, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -37,7 +37,7 @@
         cas = cas_base * pfa_rules["cas_rate"]
         cass_base = self._get_cass_base(venit_net_impozabil)
-        cass = cass_base * pfa_rules["cass_rate"]
+        cass = cass_base ** pfa_rules["cass_rate"]
         baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
..............................F
================================== FAILURES ===================================
____ TestBoundaryValueAnalysis.test_pfa_cass_boundary_bracket_transitions _____
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000203EFBE4050>
    def test_pfa_cass_boundary_bracket_transitions(self):
        """Boundary values at CASS bracket transitions"""
        brackets = [
            (6 * 3300 - 1, 0),      # Just below first bracket
            (6 * 3300, 0),          # At first bracket boundary
            (6 * 3300 + 1, 6 * 3300), # Just above first bracket
            (12 * 3300 - 1, 6 * 3300), # Just below second bracket
            (12 * 3300, 6 * 3300), # At second bracket boundary
            (12 * 3300 + 1, 12 * 3300)
