126 : Job ID 5df80d97d5454648af670ff7e5112b2a
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (44, 31), end pos: (44, 32)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 9, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -41,7 +41,7 @@
         baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
-        impozit = baza_impozit * pfa_rules["income_tax_rate"]
+        impozit = baza_impozit ** pfa_rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
.................F
================================== FAILURES ===================================
_____ TestBoundaryValueAnalysis.test_venit_brut_boundary_just_above_zero ______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002619FD7EB10>
    def test_venit_brut_boundary_just_above_zero(self):
        """Boundary: just above zero"""
        employee = EmployeeCalculator(0.01, 2024).calculate()
        assert employee["venit_net"] > 0
        pfa = PFACalculator(0.01, 2024).calculate()
>       assert pfa["venit_net"] > 0
E       assert -0.62 > 0
tests\test_boundary_values.py:40: AssertionError
=========================== short test summary info ===========================
FAILED tests/test_boundary_values.py::TestBoundaryValueAnalysis

127 : Job ID af1acef85aac447ba0fd5fecf26209a1
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (10, 56), end pos: (10, 57)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 0, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -7,7 +7,7 @@
     def _get_cas_base(self, venit_net_impozabil: float) -> float:
         # CAS base changes with thresholds expressed in minimum wages.
         cas_rules = self.rules["pfa"]["cas_thresholds"]
-        lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
+        lower_threshold = cas_rules["lower_multiplier"] >> self.minimum_wage
         upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
         if venit_net_impozabil < lower_threshold:
.......F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_1_below_lower ________________
self = <test_basis_path.TestBasisPath object at 0x000002642230DE50>
    def test_cas_base_path_1_below_lower(self):
        """Path 1: Income is strictly below the lower threshold."""
        calc = PFACalculator(10000, 2024)
        # Threshold is 39600. Input 10000.
>       assert calc._get_cas_base(10000) == 0.0
               ^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_

128 : Job ID 94f5f6c3691c4d279eefc5b68e3aa6ed
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (11, 56), end pos: (11, 57)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 1, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -8,7 +8,7 @@
         # CAS base changes with thresholds expressed in minimum wages.
         cas_rules = self.rules["pfa"]["cas_thresholds"]
         lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
-        upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
+        upper_threshold = cas_rules["upper_multiplier"] >> self.minimum_wage
         if venit_net_impozabil < lower_threshold:
             return 0.0
.......F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_1_below_lower ________________
self = <test_basis_path.TestBasisPath object at 0x000001A8D5FADE50>
    def test_cas_base_path_1_below_lower(self):
        """Path 1: Income is strictly below the lower threshold."""
        calc = PFACalculator(10000, 2024)
        # Threshold is 39600. Input 10000.
>       assert calc._get_cas_base(10000) == 0.0
               ^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001A8D5FB5

129 : Job ID 08ba09224fe8415cb290b49ef4a0551f
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (16, 54), end pos: (16, 55)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 2, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -13,7 +13,7 @@
         if venit_net_impozabil < lower_threshold:
             return 0.0
         if venit_net_impozabil < upper_threshold:
-            return cas_rules["lower_base_multiplier"] * self.minimum_wage
+            return cas_rules["lower_base_multiplier"] >> self.minimum_wage
         return cas_rules["upper_base_multiplier"] * self.minimum_wage
     def _get_cass_base(self, venit_net_impozabil: float) -> float:
........F
================================== FAILURES ===================================
____________ TestBasisPath.test_cas_base_path_2_between_thresholds ____________
self = <test_basis_path.TestBasisPath object at 0x000001AAA46BDF90>
    def test_cas_base_path_2_between_thresholds(self):
        """Path 2: Income is between the lower and upper thresholds."""
        calc = PFACalculator(50000, 2024)
        # Thresholds: 39600 and 79200. Input 50000.
        min_wage = 3300
>       assert calc._get_cas_base(50000) == 12 * min_wage
               ^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:35: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PF

130 : Job ID f650abf1d8de42fe93599ff578d5f715
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (17, 50), end pos: (17, 51)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 3, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -14,7 +14,7 @@
             return 0.0
         if venit_net_impozabil < upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
-        return cas_rules["upper_base_multiplier"] * self.minimum_wage
+        return cas_rules["upper_base_multiplier"] >> self.minimum_wage
     def _get_cass_base(self, venit_net_impozabil: float) -> float:
         # CASS uses progressive brackets configured per fiscal year.
.........F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_3_above_upper ________________
self = <test_basis_path.TestBasisPath object at 0x00000190EE8829E0>
    def test_cas_base_path_3_above_upper(self):
        """Path 3: Income is exactly at or above the upper threshold."""
        calc = PFACalculator(100000, 2024)
        # Upper threshold is 79200. Input 100000.
        min_wage = 3300
>       assert calc._get_cas_base(100000) == 24 * min_wage
               ^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:42: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calcul

131 : Job ID cca2eaebd43c46e38f23bebae55bf5fd
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (24, 61), end pos: (24, 62)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 4, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -21,7 +21,7 @@
         brackets = self.rules["pfa"]["cass_brackets"]
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
-            if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
+            if upper is None or venit_net_impozabil <= upper >> self.minimum_wage:
                 return bracket["base_multiplier"] * self.minimum_wage
         return 0.0
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000018A1FA3E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
src\calculator_pfa.py:39: in calculate
    cass_base

132 : Job ID 4aee3dfbb5874acdb761be972abba28a
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (25, 50), end pos: (25, 51)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 5, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -22,7 +22,7 @@
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
             if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
-                return bracket["base_multiplier"] * self.minimum_wage
+                return bracket["base_multiplier"] >> self.minimum_wage
         return 0.0
     def calculate(self) -> Dict[str, float]:
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000027C8FB5E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
src\calculator_pfa.py:39: in calculate
    cass_base = self._get_cass_base

133 : Job ID 5c7dc00978b2463e89bf5ceff73b1599
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (32, 37), end pos: (32, 38)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 6, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -29,7 +29,7 @@
         pfa_rules = self.rules["pfa"]
         expense_ratio = pfa_rules.get("expense_ratio", 0.0)
-        cheltuieli = self.venit_brut * expense_ratio
+        cheltuieli = self.venit_brut >> expense_ratio
         # Current model uses a configurable flat expense ratio.
         venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001C2CC3EE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001C2CC38EF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules =

134 : Job ID fb40f32f1e844e9787c72f714b549c30
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (37, 23), end pos: (37, 24)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 7, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -34,7 +34,7 @@
         venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
         cas_base = self._get_cas_base(venit_net_impozabil)
-        cas = cas_base * pfa_rules["cas_rate"]
+        cas = cas_base >> pfa_rules["cas_rate"]
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002BD09A0E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000002BD099AEF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self

135 : Job ID 41374a936cdc4244b42efb5964584e7e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (40, 25), end pos: (40, 26)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 8, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -37,7 +37,7 @@
         cas = cas_base * pfa_rules["cas_rate"]
         cass_base = self._get_cass_base(venit_net_impozabil)
-        cass = cass_base * pfa_rules["cass_rate"]
+        cass = cass_base >> pfa_rules["cass_rate"]
         baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002216F58E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000002216F52EF10>
    def calculate(self) -> Dict[str, float]:

136 : Job ID 09d487327bf643dfaffacfbe95232adb
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (44, 31), end pos: (44, 32)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 9, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -41,7 +41,7 @@
         baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
-        impozit = baza_impozit * pfa_rules["income_tax_rate"]
+        impozit = baza_impozit >> pfa_rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001DE330BA350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001DE3305EF10>
    def calculate(self) -> Dict[str,

137 : Job ID d3730c47814e47e29faf574e3b47bbcb
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (10, 56), end pos: (10, 57)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 0, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -7,7 +7,7 @@
     def _get_cas_base(self, venit_net_impozabil: float) -> float:
         # CAS base changes with thresholds expressed in minimum wages.
         cas_rules = self.rules["pfa"]["cas_thresholds"]
-        lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
+        lower_threshold = cas_rules["lower_multiplier"] << self.minimum_wage
         upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
         if venit_net_impozabil < lower_threshold:
.......F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_1_below_lower ________________
self = <test_basis_path.TestBasisPath object at 0x00000150DABEDE50>
    def test_cas_base_path_1_below_lower(self):
        """Path 1: Income is strictly below the lower threshold."""
        calc = PFACalculator(10000, 2024)
        # Threshold is 39600. Input 10000.
>       assert calc._get_cas_base(10000) == 0.0
               ^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_

138 : Job ID 0f9adddfdf0c49aeae255b45d33194f8
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (11, 56), end pos: (11, 57)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 1, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -8,7 +8,7 @@
         # CAS base changes with thresholds expressed in minimum wages.
         cas_rules = self.rules["pfa"]["cas_thresholds"]
         lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
-        upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
+        upper_threshold = cas_rules["upper_multiplier"] << self.minimum_wage
         if venit_net_impozabil < lower_threshold:
             return 0.0
.......F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_1_below_lower ________________
self = <test_basis_path.TestBasisPath object at 0x0000026B0B98DE50>
    def test_cas_base_path_1_below_lower(self):
        """Path 1: Income is strictly below the lower threshold."""
        calc = PFACalculator(10000, 2024)
        # Threshold is 39600. Input 10000.
>       assert calc._get_cas_base(10000) == 0.0
               ^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000026B0B995

139 : Job ID 362b0beba70944c0a3192826f2d6457e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (16, 54), end pos: (16, 55)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 2, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -13,7 +13,7 @@
         if venit_net_impozabil < lower_threshold:
             return 0.0
         if venit_net_impozabil < upper_threshold:
-            return cas_rules["lower_base_multiplier"] * self.minimum_wage
+            return cas_rules["lower_base_multiplier"] << self.minimum_wage
         return cas_rules["upper_base_multiplier"] * self.minimum_wage
     def _get_cass_base(self, venit_net_impozabil: float) -> float:
........F
================================== FAILURES ===================================
____________ TestBasisPath.test_cas_base_path_2_between_thresholds ____________
self = <test_basis_path.TestBasisPath object at 0x000001A99FDC9F90>
    def test_cas_base_path_2_between_thresholds(self):
        """Path 2: Income is between the lower and upper thresholds."""
        calc = PFACalculator(50000, 2024)
        # Thresholds: 39600 and 79200. Input 50000.
        min_wage = 3300
>       assert calc._get_cas_base(50000) == 12 * min_wage
               ^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:35: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PF

140 : Job ID 3bc944f1685d4e85a0bfde42ca2ef9cd
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (17, 50), end pos: (17, 51)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 3, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -14,7 +14,7 @@
             return 0.0
         if venit_net_impozabil < upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
-        return cas_rules["upper_base_multiplier"] * self.minimum_wage
+        return cas_rules["upper_base_multiplier"] << self.minimum_wage
     def _get_cass_base(self, venit_net_impozabil: float) -> float:
         # CASS uses progressive brackets configured per fiscal year.
.........F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_3_above_upper ________________
self = <test_basis_path.TestBasisPath object at 0x000002205DFDE9E0>
    def test_cas_base_path_3_above_upper(self):
        """Path 3: Income is exactly at or above the upper threshold."""
        calc = PFACalculator(100000, 2024)
        # Upper threshold is 79200. Input 100000.
        min_wage = 3300
>       assert calc._get_cas_base(100000) == 24 * min_wage
               ^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:42: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calcul

141 : Job ID a87c8c43659643118c54e1a52c70a6aa
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (24, 61), end pos: (24, 62)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 4, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -21,7 +21,7 @@
         brackets = self.rules["pfa"]["cass_brackets"]
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
-            if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
+            if upper is None or venit_net_impozabil <= upper << self.minimum_wage:
                 return bracket["base_multiplier"] * self.minimum_wage
         return 0.0
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001CF8708A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
src\calculator_pfa.py:39: in calculate
    cass_base

142 : Job ID 8b324cc3bfa04ff49cb93d35f21957a3
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (25, 50), end pos: (25, 51)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 5, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -22,7 +22,7 @@
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
             if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
-                return bracket["base_multiplier"] * self.minimum_wage
+                return bracket["base_multiplier"] << self.minimum_wage
         return 0.0
     def calculate(self) -> Dict[str, float]:
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001A74375A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
src\calculator_pfa.py:39: in calculate
    cass_base = self._get_cass_base

143 : Job ID b0a73b9569db4f57944d05b076f79d91
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (32, 37), end pos: (32, 38)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 6, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -29,7 +29,7 @@
         pfa_rules = self.rules["pfa"]
         expense_ratio = pfa_rules.get("expense_ratio", 0.0)
-        cheltuieli = self.venit_brut * expense_ratio
+        cheltuieli = self.venit_brut << expense_ratio
         # Current model uses a configurable flat expense ratio.
         venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000268E6BBE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x00000268E6B5EF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules =

144 : Job ID 1f153971c94d40acb6a9a945f46e38a8
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (37, 23), end pos: (37, 24)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 7, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -34,7 +34,7 @@
         venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
         cas_base = self._get_cas_base(venit_net_impozabil)
-        cas = cas_base * pfa_rules["cas_rate"]
+        cas = cas_base << pfa_rules["cas_rate"]
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000025AF4CAA350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000025AF4C4EF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self
