145 : Job ID b34243e1bd8b4abcb3f780be77509dc5
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (40, 25), end pos: (40, 26)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 8, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -37,7 +37,7 @@
         cas = cas_base * pfa_rules["cas_rate"]
         cass_base = self._get_cass_base(venit_net_impozabil)
-        cass = cass_base * pfa_rules["cass_rate"]
+        cass = cass_base << pfa_rules["cass_rate"]
         baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000015C9E29A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000015C9E23EF10>
    def calculate(self) -> Dict[str, float]:

146 : Job ID 366edb2bc1214c119d747cd494b05a30
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (44, 31), end pos: (44, 32)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 9, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -41,7 +41,7 @@
         baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
-        impozit = baza_impozit * pfa_rules["income_tax_rate"]
+        impozit = baza_impozit << pfa_rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000023609ABE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000023609A5EF10>
    def calculate(self) -> Dict[str,

147 : Job ID 32d47b7a69a94067a60a434edf224c28
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (10, 56), end pos: (10, 57)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 0, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -7,7 +7,7 @@
     def _get_cas_base(self, venit_net_impozabil: float) -> float:
         # CAS base changes with thresholds expressed in minimum wages.
         cas_rules = self.rules["pfa"]["cas_thresholds"]
-        lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
+        lower_threshold = cas_rules["lower_multiplier"] | self.minimum_wage
         upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
         if venit_net_impozabil < lower_threshold:
.......F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_1_below_lower ________________
self = <test_basis_path.TestBasisPath object at 0x000001AD3C1D9E50>
    def test_cas_base_path_1_below_lower(self):
        """Path 1: Income is strictly below the lower threshold."""
        calc = PFACalculator(10000, 2024)
        # Threshold is 39600. Input 10000.
>       assert calc._get_cas_base(10000) == 0.0
               ^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pf

148 : Job ID 850c9462330842f29d0c77e4160d742e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (11, 56), end pos: (11, 57)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 1, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -8,7 +8,7 @@
         # CAS base changes with thresholds expressed in minimum wages.
         cas_rules = self.rules["pfa"]["cas_thresholds"]
         lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
-        upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
+        upper_threshold = cas_rules["upper_multiplier"] | self.minimum_wage
         if venit_net_impozabil < lower_threshold:
             return 0.0
.......F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_1_below_lower ________________
self = <test_basis_path.TestBasisPath object at 0x000001684ACEDE50>
    def test_cas_base_path_1_below_lower(self):
        """Path 1: Income is strictly below the lower threshold."""
        calc = PFACalculator(10000, 2024)
        # Threshold is 39600. Input 10000.
>       assert calc._get_cas_base(10000) == 0.0
               ^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001684ACF57F

149 : Job ID 4b885a0ec97040ce814515f83d1e40a8
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (16, 54), end pos: (16, 55)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 2, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -13,7 +13,7 @@
         if venit_net_impozabil < lower_threshold:
             return 0.0
         if venit_net_impozabil < upper_threshold:
-            return cas_rules["lower_base_multiplier"] * self.minimum_wage
+            return cas_rules["lower_base_multiplier"] | self.minimum_wage
         return cas_rules["upper_base_multiplier"] * self.minimum_wage
     def _get_cass_base(self, venit_net_impozabil: float) -> float:
........F
================================== FAILURES ===================================
____________ TestBasisPath.test_cas_base_path_2_between_thresholds ____________
self = <test_basis_path.TestBasisPath object at 0x00000201C8BC9F90>
    def test_cas_base_path_2_between_thresholds(self):
        """Path 2: Income is between the lower and upper thresholds."""
        calc = PFACalculator(50000, 2024)
        # Thresholds: 39600 and 79200. Input 50000.
        min_wage = 3300
>       assert calc._get_cas_base(50000) == 12 * min_wage
               ^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:35: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFAC

150 : Job ID a79a83fa89594f5ab4fa290a51a3c397
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (17, 50), end pos: (17, 51)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 3, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -14,7 +14,7 @@
             return 0.0
         if venit_net_impozabil < upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
-        return cas_rules["upper_base_multiplier"] * self.minimum_wage
+        return cas_rules["upper_base_multiplier"] | self.minimum_wage
     def _get_cass_base(self, venit_net_impozabil: float) -> float:
         # CASS uses progressive brackets configured per fiscal year.
.........F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_3_above_upper ________________
self = <test_basis_path.TestBasisPath object at 0x000001AF7F1429E0>
    def test_cas_base_path_3_above_upper(self):
        """Path 3: Income is exactly at or above the upper threshold."""
        calc = PFACalculator(100000, 2024)
        # Upper threshold is 79200. Input 100000.
        min_wage = 3300
>       assert calc._get_cas_base(100000) == 24 * min_wage
               ^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:42: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculat

151 : Job ID e57629c2b86b48a7933ec52a96847e85
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (24, 61), end pos: (24, 62)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 4, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -21,7 +21,7 @@
         brackets = self.rules["pfa"]["cass_brackets"]
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
-            if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
+            if upper is None or venit_net_impozabil <= upper | self.minimum_wage:
                 return bracket["base_multiplier"] * self.minimum_wage
         return 0.0
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001A1014CE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
src\calculator_pfa.py:39: in calculate
    cass_base =

152 : Job ID 1069c98edf4b4d3791d3a884508ca4d4
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (25, 50), end pos: (25, 51)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 5, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -22,7 +22,7 @@
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
             if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
-                return bracket["base_multiplier"] * self.minimum_wage
+                return bracket["base_multiplier"] | self.minimum_wage
         return 0.0
     def calculate(self) -> Dict[str, float]:
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000024A8BF9E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
src\calculator_pfa.py:39: in calculate
    cass_base = self._get_cass_base(v

153 : Job ID 80617d7a31c64b3480de7c667e36cb02
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (32, 37), end pos: (32, 38)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 6, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -29,7 +29,7 @@
         pfa_rules = self.rules["pfa"]
         expense_ratio = pfa_rules.get("expense_ratio", 0.0)
-        cheltuieli = self.venit_brut * expense_ratio
+        cheltuieli = self.venit_brut | expense_ratio
         # Current model uses a configurable flat expense ratio.
         venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001E462F5A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001E462EFEF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = se

154 : Job ID 8db8b8cc066d44b7aba7065e0d3dcdaf
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (37, 23), end pos: (37, 24)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 7, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -34,7 +34,7 @@
         venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
         cas_base = self._get_cas_base(venit_net_impozabil)
-        cas = cas_base * pfa_rules["cas_rate"]
+        cas = cas_base | pfa_rules["cas_rate"]
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000028E7DF6A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000028E7DF0EF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self.r

155 : Job ID 56e6899f56de4443b637a07037238a58
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (40, 25), end pos: (40, 26)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 8, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -37,7 +37,7 @@
         cas = cas_base * pfa_rules["cas_rate"]
         cass_base = self._get_cass_base(venit_net_impozabil)
-        cass = cass_base * pfa_rules["cass_rate"]
+        cass = cass_base | pfa_rules["cass_rate"]
         baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001ABD445E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001ABD43FEF10>
    def calculate(self) -> Dict[str, float]:

156 : Job ID 6ffe90298eda4a27821f4505525a93c4
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (44, 31), end pos: (44, 32)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 9, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -41,7 +41,7 @@
         baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
-        impozit = baza_impozit * pfa_rules["income_tax_rate"]
+        impozit = baza_impozit | pfa_rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000026C26A8E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000026C26A2EF10>
    def calculate(self) -> Dict[str, fl

157 : Job ID 5a1dbcb84c6b4481945b4b0e8ee51925
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (10, 56), end pos: (10, 57)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 0, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -7,7 +7,7 @@
     def _get_cas_base(self, venit_net_impozabil: float) -> float:
         # CAS base changes with thresholds expressed in minimum wages.
         cas_rules = self.rules["pfa"]["cas_thresholds"]
-        lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
+        lower_threshold = cas_rules["lower_multiplier"] & self.minimum_wage
         upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
         if venit_net_impozabil < lower_threshold:
.......F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_1_below_lower ________________
self = <test_basis_path.TestBasisPath object at 0x000001F97C1BDE50>
    def test_cas_base_path_1_below_lower(self):
        """Path 1: Income is strictly below the lower threshold."""
        calc = PFACalculator(10000, 2024)
        # Threshold is 39600. Input 10000.
>       assert calc._get_cas_base(10000) == 0.0
               ^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_p

158 : Job ID 1e92a8bb099c492098971eaf1d0a4acf
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (11, 56), end pos: (11, 57)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 1, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -8,7 +8,7 @@
         # CAS base changes with thresholds expressed in minimum wages.
         cas_rules = self.rules["pfa"]["cas_thresholds"]
         lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
-        upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
+        upper_threshold = cas_rules["upper_multiplier"] & self.minimum_wage
         if venit_net_impozabil < lower_threshold:
             return 0.0
.......F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_1_below_lower ________________
self = <test_basis_path.TestBasisPath object at 0x000001E99DCFDE50>
    def test_cas_base_path_1_below_lower(self):
        """Path 1: Income is strictly below the lower threshold."""
        calc = PFACalculator(10000, 2024)
        # Threshold is 39600. Input 10000.
>       assert calc._get_cas_base(10000) == 0.0
               ^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001E99DD057

159 : Job ID 428db6628b0d4f5db175f47dc21d76bb
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (16, 54), end pos: (16, 55)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 2, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -13,7 +13,7 @@
         if venit_net_impozabil < lower_threshold:
             return 0.0
         if venit_net_impozabil < upper_threshold:
-            return cas_rules["lower_base_multiplier"] * self.minimum_wage
+            return cas_rules["lower_base_multiplier"] & self.minimum_wage
         return cas_rules["upper_base_multiplier"] * self.minimum_wage
     def _get_cass_base(self, venit_net_impozabil: float) -> float:
........F
================================== FAILURES ===================================
____________ TestBasisPath.test_cas_base_path_2_between_thresholds ____________
self = <test_basis_path.TestBasisPath object at 0x00000286FDED9F90>
    def test_cas_base_path_2_between_thresholds(self):
        """Path 2: Income is between the lower and upper thresholds."""
        calc = PFACalculator(50000, 2024)
        # Thresholds: 39600 and 79200. Input 50000.
        min_wage = 3300
>       assert calc._get_cas_base(50000) == 12 * min_wage
               ^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:35: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFA

160 : Job ID 0e8a27b7f03549cdb65acc2a02614f2a
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (17, 50), end pos: (17, 51)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 3, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -14,7 +14,7 @@
             return 0.0
         if venit_net_impozabil < upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
-        return cas_rules["upper_base_multiplier"] * self.minimum_wage
+        return cas_rules["upper_base_multiplier"] & self.minimum_wage
     def _get_cass_base(self, venit_net_impozabil: float) -> float:
         # CASS uses progressive brackets configured per fiscal year.
.........F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_3_above_upper ________________
self = <test_basis_path.TestBasisPath object at 0x000001C1230529E0>
    def test_cas_base_path_3_above_upper(self):
        """Path 3: Income is exactly at or above the upper threshold."""
        calc = PFACalculator(100000, 2024)
        # Upper threshold is 79200. Input 100000.
        min_wage = 3300
>       assert calc._get_cas_base(100000) == 24 * min_wage
               ^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:42: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calcula

161 : Job ID af596227e2a04238a778cc9fcb3af295
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (24, 61), end pos: (24, 62)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 4, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -21,7 +21,7 @@
         brackets = self.rules["pfa"]["cass_brackets"]
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
-            if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
+            if upper is None or venit_net_impozabil <= upper & self.minimum_wage:
                 return bracket["base_multiplier"] * self.minimum_wage
         return 0.0
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000017B64FCA350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
src\calculator_pfa.py:39: in calculate
    cass_base =

162 : Job ID 79384a49604146719dfe711ec0279f32
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (25, 50), end pos: (25, 51)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 5, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -22,7 +22,7 @@
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
             if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
-                return bracket["base_multiplier"] * self.minimum_wage
+                return bracket["base_multiplier"] & self.minimum_wage
         return 0.0
     def calculate(self) -> Dict[str, float]:
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000029F0CBFE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
src\calculator_pfa.py:39: in calculate
    cass_base = self._get_cass_base(

163 : Job ID 97136bd0fefd4b3198cd996912992242
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (32, 37), end pos: (32, 38)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 6, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -29,7 +29,7 @@
         pfa_rules = self.rules["pfa"]
         expense_ratio = pfa_rules.get("expense_ratio", 0.0)
-        cheltuieli = self.venit_brut * expense_ratio
+        cheltuieli = self.venit_brut & expense_ratio
         # Current model uses a configurable flat expense ratio.
         venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001FAC9DDE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001FAC9D7EF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = s
