164 : Job ID 2421efd1e36941339024d99876945889
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (37, 23), end pos: (37, 24)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 7, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -34,7 +34,7 @@
         venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
         cas_base = self._get_cas_base(venit_net_impozabil)
-        cas = cas_base * pfa_rules["cas_rate"]
+        cas = cas_base & pfa_rules["cas_rate"]
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002A31366E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000002A31360EF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self.

165 : Job ID c5a1fc2b0dad45f8a520d0dc7eaedc13
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (40, 25), end pos: (40, 26)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 8, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -37,7 +37,7 @@
         cas = cas_base * pfa_rules["cas_rate"]
         cass_base = self._get_cass_base(venit_net_impozabil)
-        cass = cass_base * pfa_rules["cass_rate"]
+        cass = cass_base & pfa_rules["cass_rate"]
         baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000177DB1EE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x00000177DB18EF10>
    def calculate(self) -> Dict[str, float]:

166 : Job ID 7bd9c2d52d4c44d180b751be146b2f88
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (44, 31), end pos: (44, 32)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 9, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -41,7 +41,7 @@
         baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
-        impozit = baza_impozit * pfa_rules["income_tax_rate"]
+        impozit = baza_impozit & pfa_rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000021AAE7CE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000021AAE76EF10>
    def calculate(self) -> Dict[str, f

167 : Job ID 373f98f612ea469591ad94abcf5362f8
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (10, 56), end pos: (10, 57)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 0, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -7,7 +7,7 @@
     def _get_cas_base(self, venit_net_impozabil: float) -> float:
         # CAS base changes with thresholds expressed in minimum wages.
         cas_rules = self.rules["pfa"]["cas_thresholds"]
-        lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
+        lower_threshold = cas_rules["lower_multiplier"] ^ self.minimum_wage
         upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
         if venit_net_impozabil < lower_threshold:
.......F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_1_below_lower ________________
self = <test_basis_path.TestBasisPath object at 0x0000012D632ADE50>
    def test_cas_base_path_1_below_lower(self):
        """Path 1: Income is strictly below the lower threshold."""
        calc = PFACalculator(10000, 2024)
        # Threshold is 39600. Input 10000.
>       assert calc._get_cas_base(10000) == 0.0
               ^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_p

168 : Job ID 1d9519d2d7d447f6a9f51b8b2fb5f0f7
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (11, 56), end pos: (11, 57)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 1, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -8,7 +8,7 @@
         # CAS base changes with thresholds expressed in minimum wages.
         cas_rules = self.rules["pfa"]["cas_thresholds"]
         lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
-        upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
+        upper_threshold = cas_rules["upper_multiplier"] ^ self.minimum_wage
         if venit_net_impozabil < lower_threshold:
             return 0.0
.......F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_1_below_lower ________________
self = <test_basis_path.TestBasisPath object at 0x0000025D2968DE50>
    def test_cas_base_path_1_below_lower(self):
        """Path 1: Income is strictly below the lower threshold."""
        calc = PFACalculator(10000, 2024)
        # Threshold is 39600. Input 10000.
>       assert calc._get_cas_base(10000) == 0.0
               ^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000025D296957

169 : Job ID 2234105d32b14a188ad1826befdd4be5
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (16, 54), end pos: (16, 55)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 2, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -13,7 +13,7 @@
         if venit_net_impozabil < lower_threshold:
             return 0.0
         if venit_net_impozabil < upper_threshold:
-            return cas_rules["lower_base_multiplier"] * self.minimum_wage
+            return cas_rules["lower_base_multiplier"] ^ self.minimum_wage
         return cas_rules["upper_base_multiplier"] * self.minimum_wage
     def _get_cass_base(self, venit_net_impozabil: float) -> float:
........F
================================== FAILURES ===================================
____________ TestBasisPath.test_cas_base_path_2_between_thresholds ____________
self = <test_basis_path.TestBasisPath object at 0x000001532D1DDF90>
    def test_cas_base_path_2_between_thresholds(self):
        """Path 2: Income is between the lower and upper thresholds."""
        calc = PFACalculator(50000, 2024)
        # Thresholds: 39600 and 79200. Input 50000.
        min_wage = 3300
>       assert calc._get_cas_base(50000) == 12 * min_wage
               ^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:35: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFA

170 : Job ID 53ac552f51cf4c88a56b0e76a6caae05
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (17, 50), end pos: (17, 51)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 3, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -14,7 +14,7 @@
             return 0.0
         if venit_net_impozabil < upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
-        return cas_rules["upper_base_multiplier"] * self.minimum_wage
+        return cas_rules["upper_base_multiplier"] ^ self.minimum_wage
     def _get_cass_base(self, venit_net_impozabil: float) -> float:
         # CASS uses progressive brackets configured per fiscal year.
.........F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_3_above_upper ________________
self = <test_basis_path.TestBasisPath object at 0x000001D27D4E29E0>
    def test_cas_base_path_3_above_upper(self):
        """Path 3: Income is exactly at or above the upper threshold."""
        calc = PFACalculator(100000, 2024)
        # Upper threshold is 79200. Input 100000.
        min_wage = 3300
>       assert calc._get_cas_base(100000) == 24 * min_wage
               ^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_basis_path.py:42: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calcula

171 : Job ID d3600e05d84b460d89360558bb843609
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (24, 61), end pos: (24, 62)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 4, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -21,7 +21,7 @@
         brackets = self.rules["pfa"]["cass_brackets"]
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
-            if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
+            if upper is None or venit_net_impozabil <= upper ^ self.minimum_wage:
                 return bracket["base_multiplier"] * self.minimum_wage
         return 0.0
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000222AFA4E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
src\calculator_pfa.py:39: in calculate
    cass_base =

172 : Job ID 4d0eaaa2a3c74b469eac57902b600496
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (25, 50), end pos: (25, 51)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 5, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -22,7 +22,7 @@
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
             if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
-                return bracket["base_multiplier"] * self.minimum_wage
+                return bracket["base_multiplier"] ^ self.minimum_wage
         return 0.0
     def calculate(self) -> Dict[str, float]:
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000018C59C7E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
src\calculator_pfa.py:39: in calculate
    cass_base = self._get_cass_base(

173 : Job ID 82294decbbe2459ea4ffb381107e7c87
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (32, 37), end pos: (32, 38)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 6, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -29,7 +29,7 @@
         pfa_rules = self.rules["pfa"]
         expense_ratio = pfa_rules.get("expense_ratio", 0.0)
-        cheltuieli = self.venit_brut * expense_ratio
+        cheltuieli = self.venit_brut ^ expense_ratio
         # Current model uses a configurable flat expense ratio.
         venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000121F990A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x00000121F98AEF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = s

174 : Job ID 10d2c188b5264c57bfc1cdc417c4bd2c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (37, 23), end pos: (37, 24)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 7, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -34,7 +34,7 @@
         venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
         cas_base = self._get_cas_base(venit_net_impozabil)
-        cas = cas_base * pfa_rules["cas_rate"]
+        cas = cas_base ^ pfa_rules["cas_rate"]
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001A3FF8BA350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000001A3FF85EF10>
    def calculate(self) -> Dict[str, float]:
        pfa_rules = self.

175 : Job ID 63e6cbb5d7c54f648bbdff4527f6ed96
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (40, 25), end pos: (40, 26)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 8, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -37,7 +37,7 @@
         cas = cas_base * pfa_rules["cas_rate"]
         cass_base = self._get_cass_base(venit_net_impozabil)
-        cass = cass_base * pfa_rules["cass_rate"]
+        cass = cass_base ^ pfa_rules["cass_rate"]
         baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000022BF79CA350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x0000022BF796EF10>
    def calculate(self) -> Dict[str, float]:

176 : Job ID 89d446faaf0e4483b87e5407962d7308
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (44, 31), end pos: (44, 32)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 9, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -41,7 +41,7 @@
         baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
-        impozit = baza_impozit * pfa_rules["income_tax_rate"]
+        impozit = baza_impozit ^ pfa_rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002E52D7CA350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_pfa.PFACalculator object at 0x000002E52D76EF10>
    def calculate(self) -> Dict[str, f

177 : Job ID 3854e9e530924cf290388ac71c2d76dd
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (13, 31), end pos: (13, 32)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -10,7 +10,7 @@
         lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
         upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
-        if venit_net_impozabil < lower_threshold:
+        if venit_net_impozabil == lower_threshold:
             return 0.0
         if venit_net_impozabil < upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
.......F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_1_below_lower ________________
self = <test_basis_path.TestBasisPath object at 0x0000028011D5DE50>
    def test_cas_base_path_1_below_lower(self):
        """Path 1: Income is strictly below the lower threshold."""
        calc = PFACalculator(10000, 2024)
        # Threshold is 39600. Input 10000.
>       assert calc._get_cas_base(10000) == 0.0
E       assert 39600.0 == 0.0
E        +  where 39600.0 = _get_cas_base(10000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x0000028011D657F0>._get_cas_base
tests\test_basis_path.py:28: AssertionError
========

178 : Job ID 9a9cb4be52d9446fb92686b44176f111
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (15, 31), end pos: (15, 32)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 1, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -12,7 +12,7 @@
         if venit_net_impozabil < lower_threshold:
             return 0.0
-        if venit_net_impozabil < upper_threshold:
+        if venit_net_impozabil == upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
         return cas_rules["upper_base_multiplier"] * self.minimum_wage
........F
================================== FAILURES ===================================
____________ TestBasisPath.test_cas_base_path_2_between_thresholds ____________
self = <test_basis_path.TestBasisPath object at 0x00000264924FDF90>
    def test_cas_base_path_2_between_thresholds(self):
        """Path 2: Income is between the lower and upper thresholds."""
        calc = PFACalculator(50000, 2024)
        # Thresholds: 39600 and 79200. Input 50000.
        min_wage = 3300
>       assert calc._get_cas_base(50000) == 12 * min_wage
E       assert 79200.0 == (12 * 3300)
E        +  where 79200.0 = _get_cas_base(50000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x00000264924FDD10>._get_cas_base
tests\test_basis_path.py:35: AssertionError
===========================

179 : Job ID 1cf73e5e7a1e4a9c91d2156855a5e099
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (13, 31), end pos: (13, 32)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -10,7 +10,7 @@
         lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
         upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
-        if venit_net_impozabil < lower_threshold:
+        if venit_net_impozabil != lower_threshold:
             return 0.0
         if venit_net_impozabil < upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
........F
================================== FAILURES ===================================
____________ TestBasisPath.test_cas_base_path_2_between_thresholds ____________
self = <test_basis_path.TestBasisPath object at 0x0000020754C1DF90>
    def test_cas_base_path_2_between_thresholds(self):
        """Path 2: Income is between the lower and upper thresholds."""
        calc = PFACalculator(50000, 2024)
        # Thresholds: 39600 and 79200. Input 50000.
        min_wage = 3300
>       assert calc._get_cas_base(50000) == 12 * min_wage
E       assert 0.0 == (12 * 3300)
E        +  where 0.0 = _get_cas_base(50000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x0000020754C1DD10>._get_cas

180 : Job ID eb2fb5f05c56496586e1cfbd1fe58b27
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (15, 31), end pos: (15, 32)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 1, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -12,7 +12,7 @@
         if venit_net_impozabil < lower_threshold:
             return 0.0
-        if venit_net_impozabil < upper_threshold:
+        if venit_net_impozabil != upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
         return cas_rules["upper_base_multiplier"] * self.minimum_wage
.........F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_3_above_upper ________________
self = <test_basis_path.TestBasisPath object at 0x000001C9655829E0>
    def test_cas_base_path_3_above_upper(self):
        """Path 3: Income is exactly at or above the upper threshold."""
        calc = PFACalculator(100000, 2024)
        # Upper threshold is 79200. Input 100000.
        min_wage = 3300
>       assert calc._get_cas_base(100000) == 24 * min_wage
E       assert 39600.0 == (24 * 3300)
E        +  where 39600.0 = _get_cas_base(100000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x000001C9655CDD10>._get_cas_base
tests\test_basis_path.py:42: AssertionError
=========================== s

181 : Job ID a3546070d6974e83aa0d42af2523af28
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (13, 31), end pos: (13, 32)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -10,7 +10,7 @@
         lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
         upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
-        if venit_net_impozabil < lower_threshold:
+        if venit_net_impozabil <= lower_threshold:
             return 0.0
         if venit_net_impozabil < upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
.........................F
================================== FAILURES ===================================
_______ TestBoundaryValueAnalysis.test_pfa_cas_boundary_lower_threshold _______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001BCDCAB0AA0>
    def test_pfa_cas_boundary_lower_threshold(self):
        """Boundary: exactly at lower CAS threshold"""
        threshold = 12 * 3300  # 39600
        venit = threshold
        pfa = PFACalculator(venit, 2024).calculate()
        expected_cas = 12 * 3300 * 0.25  # lower_base_multiplier * minimum_wage * cas_rate
>       assert pfa["cas"] == expected_cas
E       assert 0.0 == 9900.0
tests\test_boundary_values.py:109: AssertionError
================

182 : Job ID 5adf4d08dd064465893c5e6673c00629
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (15, 31), end pos: (15, 32)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 1, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -12,7 +12,7 @@
         if venit_net_impozabil < lower_threshold:
             return 0.0
-        if venit_net_impozabil < upper_threshold:
+        if venit_net_impozabil <= upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
         return cas_rules["upper_base_multiplier"] * self.minimum_wage
............................F
================================== FAILURES ===================================
_______ TestBoundaryValueAnalysis.test_pfa_cas_boundary_upper_threshold _______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000027E8D608530>
    def test_pfa_cas_boundary_upper_threshold(self):
        """Boundary: exactly at upper CAS threshold"""
        threshold = 24 * 3300  # 79200
        venit = threshold
        pfa = PFACalculator(venit, 2024).calculate()
        expected_cas = 24 * 3300 * 0.25  # upper_base_multiplier * minimum_wage * cas_rate
>       assert pfa["cas"] == expected_cas
E       assert 9900.0 == 19800.0
tests\test_boundary_values.py:133: AssertionError
=========================== short test summary info ===========================
FAILED tests
