183 : Job ID 4fb9cd5f90b646649c6db8a4b54fc1fe
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (13, 31), end pos: (13, 32)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -10,7 +10,7 @@
         lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
         upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
-        if venit_net_impozabil < lower_threshold:
+        if venit_net_impozabil > lower_threshold:
             return 0.0
         if venit_net_impozabil < upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
.......F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_1_below_lower ________________
self = <test_basis_path.TestBasisPath object at 0x00000204A982DE50>
    def test_cas_base_path_1_below_lower(self):
        """Path 1: Income is strictly below the lower threshold."""
        calc = PFACalculator(10000, 2024)
        # Threshold is 39600. Input 10000.
>       assert calc._get_cas_base(10000) == 0.0
E       assert 39600.0 == 0.0
E        +  where 39600.0 = _get_cas_base(10000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x00000204A98357F0>._get_cas_base
tests\test_basis_path.py:28: AssertionError
=========

184 : Job ID e688bc96c97145f68dca57ee06245cd3
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (15, 31), end pos: (15, 32)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 1, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -12,7 +12,7 @@
         if venit_net_impozabil < lower_threshold:
             return 0.0
-        if venit_net_impozabil < upper_threshold:
+        if venit_net_impozabil > upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
         return cas_rules["upper_base_multiplier"] * self.minimum_wage
........F
================================== FAILURES ===================================
____________ TestBasisPath.test_cas_base_path_2_between_thresholds ____________
self = <test_basis_path.TestBasisPath object at 0x0000024DC5CCDF90>
    def test_cas_base_path_2_between_thresholds(self):
        """Path 2: Income is between the lower and upper thresholds."""
        calc = PFACalculator(50000, 2024)
        # Thresholds: 39600 and 79200. Input 50000.
        min_wage = 3300
>       assert calc._get_cas_base(50000) == 12 * min_wage
E       assert 79200.0 == (12 * 3300)
E        +  where 79200.0 = _get_cas_base(50000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x0000024DC5CCDD10>._get_cas_base
tests\test_basis_path.py:35: AssertionError
=========================== s

185 : Job ID 08f971ee6b1044c790e07dc4a804318e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (13, 31), end pos: (13, 32)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -10,7 +10,7 @@
         lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
         upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
-        if venit_net_impozabil < lower_threshold:
+        if venit_net_impozabil >= lower_threshold:
             return 0.0
         if venit_net_impozabil < upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
.......F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_1_below_lower ________________
self = <test_basis_path.TestBasisPath object at 0x000001B181C1DE50>
    def test_cas_base_path_1_below_lower(self):
        """Path 1: Income is strictly below the lower threshold."""
        calc = PFACalculator(10000, 2024)
        # Threshold is 39600. Input 10000.
>       assert calc._get_cas_base(10000) == 0.0
E       assert 39600.0 == 0.0
E        +  where 39600.0 = _get_cas_base(10000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x000001B181C257F0>._get_cas_base
tests\test_basis_path.py:28: AssertionError
=======

186 : Job ID 0bbc6df0fad647a5a4a43ceb918a9597
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (15, 31), end pos: (15, 32)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 1, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -12,7 +12,7 @@
         if venit_net_impozabil < lower_threshold:
             return 0.0
-        if venit_net_impozabil < upper_threshold:
+        if venit_net_impozabil >= upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
         return cas_rules["upper_base_multiplier"] * self.minimum_wage
........F
================================== FAILURES ===================================
____________ TestBasisPath.test_cas_base_path_2_between_thresholds ____________
self = <test_basis_path.TestBasisPath object at 0x00000178AC83DF90>
    def test_cas_base_path_2_between_thresholds(self):
        """Path 2: Income is between the lower and upper thresholds."""
        calc = PFACalculator(50000, 2024)
        # Thresholds: 39600 and 79200. Input 50000.
        min_wage = 3300
>       assert calc._get_cas_base(50000) == 12 * min_wage
E       assert 79200.0 == (12 * 3300)
E        +  where 79200.0 = _get_cas_base(50000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x00000178AC83DD10>._get_cas_base
tests\test_basis_path.py:35: AssertionError
===========================

187 : Job ID 46b106fb76d84bdb8c8b6af2c18baaa5
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (13, 31), end pos: (13, 32)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 0, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -10,7 +10,7 @@
         lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
         upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
-        if venit_net_impozabil < lower_threshold:
+        if venit_net_impozabil is lower_threshold:
             return 0.0
         if venit_net_impozabil < upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
.......F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_1_below_lower ________________
self = <test_basis_path.TestBasisPath object at 0x000001F57505DE50>
    def test_cas_base_path_1_below_lower(self):
        """Path 1: Income is strictly below the lower threshold."""
        calc = PFACalculator(10000, 2024)
        # Threshold is 39600. Input 10000.
>       assert calc._get_cas_base(10000) == 0.0
E       assert 39600.0 == 0.0
E        +  where 39600.0 = _get_cas_base(10000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x000001F5750657F0>._get_cas_base
tests\test_basis_path.py:28: AssertionError
========

188 : Job ID 5ed7d447a8e544daad5e64f30fedd4e7
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (15, 31), end pos: (15, 32)
operator: core/ReplaceComparisonOperator_Lt_Is, occurrence: 1, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -12,7 +12,7 @@
         if venit_net_impozabil < lower_threshold:
             return 0.0
-        if venit_net_impozabil < upper_threshold:
+        if venit_net_impozabil is upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
         return cas_rules["upper_base_multiplier"] * self.minimum_wage
........F
================================== FAILURES ===================================
____________ TestBasisPath.test_cas_base_path_2_between_thresholds ____________
self = <test_basis_path.TestBasisPath object at 0x00000281DB33DF90>
    def test_cas_base_path_2_between_thresholds(self):
        """Path 2: Income is between the lower and upper thresholds."""
        calc = PFACalculator(50000, 2024)
        # Thresholds: 39600 and 79200. Input 50000.
        min_wage = 3300
>       assert calc._get_cas_base(50000) == 12 * min_wage
E       assert 79200.0 == (12 * 3300)
E        +  where 79200.0 = _get_cas_base(50000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x00000281DB33DD10>._get_cas_base
tests\test_basis_path.py:35: AssertionError
===========================

189 : Job ID 2a569bd9ea764394be246db3559aa93f
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (13, 31), end pos: (13, 32)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 0, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -10,7 +10,7 @@
         lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
         upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
-        if venit_net_impozabil < lower_threshold:
+        if venit_net_impozabil is not lower_threshold:
             return 0.0
         if venit_net_impozabil < upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
........F
================================== FAILURES ===================================
____________ TestBasisPath.test_cas_base_path_2_between_thresholds ____________
self = <test_basis_path.TestBasisPath object at 0x0000027DC3879F90>
    def test_cas_base_path_2_between_thresholds(self):
        """Path 2: Income is between the lower and upper thresholds."""
        calc = PFACalculator(50000, 2024)
        # Thresholds: 39600 and 79200. Input 50000.
        min_wage = 3300
>       assert calc._get_cas_base(50000) == 12 * min_wage
E       assert 0.0 == (12 * 3300)
E        +  where 0.0 = _get_cas_base(50000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x0000027DC3879D10>._get

190 : Job ID 12e2584e3e5746519f03371a37c522d0
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (15, 31), end pos: (15, 32)
operator: core/ReplaceComparisonOperator_Lt_IsNot, occurrence: 1, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -12,7 +12,7 @@
         if venit_net_impozabil < lower_threshold:
             return 0.0
-        if venit_net_impozabil < upper_threshold:
+        if venit_net_impozabil is not upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
         return cas_rules["upper_base_multiplier"] * self.minimum_wage
.........F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_3_above_upper ________________
self = <test_basis_path.TestBasisPath object at 0x00000231DA9AE9E0>
    def test_cas_base_path_3_above_upper(self):
        """Path 3: Income is exactly at or above the upper threshold."""
        calc = PFACalculator(100000, 2024)
        # Upper threshold is 79200. Input 100000.
        min_wage = 3300
>       assert calc._get_cas_base(100000) == 24 * min_wage
E       assert 39600.0 == (24 * 3300)
E        +  where 39600.0 = _get_cas_base(100000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x00000231DA9FDD10>._get_cas_base
tests\test_basis_path.py:42: AssertionError
=========================

191 : Job ID c9aafce457de417f90b5097963149ac8
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (24, 52), end pos: (24, 54)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 0, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -21,7 +21,7 @@
         brackets = self.rules["pfa"]["cass_brackets"]
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
-            if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
+            if upper is None or venit_net_impozabil == upper * self.minimum_wage:
                 return bracket["base_multiplier"] * self.minimum_wage
         return 0.0
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002DB57B6A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
        pfa = PFACalculator(0, 2024).calculate()
>       assert pfa["venit_net"] == 0.0
E       assert -19800.0 == 0.0
tests\test_boundary_values.py:32: AssertionError
=========================== short test summary info ===========================
FAILED tests/test_b

192 : Job ID 52c3eac294254f5d80776aca978e0fc5
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (24, 52), end pos: (24, 54)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 0, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -21,7 +21,7 @@
         brackets = self.rules["pfa"]["cass_brackets"]
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
-            if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
+            if upper is None or venit_net_impozabil != upper * self.minimum_wage:
                 return bracket["base_multiplier"] * self.minimum_wage
         return 0.0
..............................F
================================== FAILURES ===================================
____ TestBoundaryValueAnalysis.test_pfa_cass_boundary_bracket_transitions _____
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000024D6A7D8050>
    def test_pfa_cass_boundary_bracket_transitions(self):
        """Boundary values at CASS bracket transitions"""
        brackets = [
            (6 * 3300 - 1, 0),      # Just below first bracket
            (6 * 3300, 0),          # At first bracket boundary
            (6 * 3300 + 1, 6 * 3300), # Just above first bracket
            (12 * 3300 - 1, 6 * 3300), # Just below second bracket
            (12 * 3300, 6 * 3300), # At

193 : Job ID a25e9d249b824e728fef4b6ae1632019
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (24, 52), end pos: (24, 54)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 0, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -21,7 +21,7 @@
         brackets = self.rules["pfa"]["cass_brackets"]
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
-            if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
+            if upper is None or venit_net_impozabil < upper * self.minimum_wage:
                 return bracket["base_multiplier"] * self.minimum_wage
         return 0.0
..............................F
================================== FAILURES ===================================
____ TestBoundaryValueAnalysis.test_pfa_cass_boundary_bracket_transitions _____
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000017C4E6B4050>
    def test_pfa_cass_boundary_bracket_transitions(self):
        """Boundary values at CASS bracket transitions"""
        brackets = [
            (6 * 3300 - 1, 0),      # Just below first bracket
            (6 * 3300, 0),          # At first bracket boundary
            (6 * 3300 + 1, 6 * 3300), # Just above first bracket
            (12 * 3300 - 1, 6 * 3300), # Just below second bracket
            (12 * 3300, 6 * 3300), # At sec

194 : Job ID c8882820f38e431dbf4517a51644ab85
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (24, 52), end pos: (24, 54)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 0, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -21,7 +21,7 @@
         brackets = self.rules["pfa"]["cass_brackets"]
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
-            if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
+            if upper is None or venit_net_impozabil > upper * self.minimum_wage:
                 return bracket["base_multiplier"] * self.minimum_wage
         return 0.0
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001C3FC9FE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
        pfa = PFACalculator(0, 2024).calculate()
>       assert pfa["venit_net"] == 0.0
E       assert -19800.0 == 0.0
tests\test_boundary_values.py:32: AssertionError
=========================== short test summary info ===========================
FAILED tests/test_bo

195 : Job ID 074d7ea94fc14ba5ab542b894bff2e49
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (24, 52), end pos: (24, 54)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 0, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -21,7 +21,7 @@
         brackets = self.rules["pfa"]["cass_brackets"]
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
-            if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
+            if upper is None or venit_net_impozabil >= upper * self.minimum_wage:
                 return bracket["base_multiplier"] * self.minimum_wage
         return 0.0
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000029A1191E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
        pfa = PFACalculator(0, 2024).calculate()
>       assert pfa["venit_net"] == 0.0
E       assert -19800.0 == 0.0
tests\test_boundary_values.py:32: AssertionError
=========================== short test summary info ===========================
FAILED tests/test_

196 : Job ID 9c5d0710c37d4d40a361f383b3bb3b5e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (24, 52), end pos: (24, 54)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 0, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -21,7 +21,7 @@
         brackets = self.rules["pfa"]["cass_brackets"]
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
-            if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
+            if upper is None or venit_net_impozabil is upper * self.minimum_wage:
                 return bracket["base_multiplier"] * self.minimum_wage
         return 0.0
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000274C173E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
        pfa = PFACalculator(0, 2024).calculate()
>       assert pfa["venit_net"] == 0.0
E       assert -19800.0 == 0.0
tests\test_boundary_values.py:32: AssertionError
=========================== short test summary info ===========================
FAILED tests/test_b

197 : Job ID b641f2db8f0c4ce6acbb587538f9af43
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (24, 52), end pos: (24, 54)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 0, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -21,7 +21,7 @@
         brackets = self.rules["pfa"]["cass_brackets"]
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
-            if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
+            if upper is None or venit_net_impozabil is not upper * self.minimum_wage:
                 return bracket["base_multiplier"] * self.minimum_wage
         return 0.0
..............................F
================================== FAILURES ===================================
____ TestBoundaryValueAnalysis.test_pfa_cass_boundary_bracket_transitions _____
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001CF0AB98050>
    def test_pfa_cass_boundary_bracket_transitions(self):
        """Boundary values at CASS bracket transitions"""
        brackets = [
            (6 * 3300 - 1, 0),      # Just below first bracket
            (6 * 3300, 0),          # At first bracket boundary
            (6 * 3300 + 1, 6 * 3300), # Just above first bracket
            (12 * 3300 - 1, 6 * 3300), # Just below second bracket
            (12 * 3300, 6 * 3300),

198 : Job ID 4c65b2eb03bb47ebbd1b6fe62487558e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (24, 21), end pos: (24, 23)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 0, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -21,7 +21,7 @@
         brackets = self.rules["pfa"]["cass_brackets"]
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
-            if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
+            if upper is not None or venit_net_impozabil <= upper * self.minimum_wage:
                 return bracket["base_multiplier"] * self.minimum_wage
         return 0.0
..............................F
================================== FAILURES ===================================
____ TestBoundaryValueAnalysis.test_pfa_cass_boundary_bracket_transitions _____
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001E1C6854050>
    def test_pfa_cass_boundary_bracket_transitions(self):
        """Boundary values at CASS bracket transitions"""
        brackets = [
            (6 * 3300 - 1, 0),      # Just below first bracket
            (6 * 3300, 0),          # At first bracket boundary
            (6 * 3300 + 1, 6 * 3300), # Just above first bracket
            (12 * 3300 - 1, 6 * 3300), # Just below second bracket
            (12 * 3300, 6 * 3300), #

199 : Job ID eba3385824c8477684c0dd16d2f34d47
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (13, 11), end pos: (13, 48)
operator: core/AddNot, occurrence: 0, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -10,7 +10,7 @@
         lower_threshold = cas_rules["lower_multiplier"] * self.minimum_wage
         upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
-        if venit_net_impozabil < lower_threshold:
+        if not venit_net_impozabil < lower_threshold:
             return 0.0
         if venit_net_impozabil < upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
.......F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_1_below_lower ________________
self = <test_basis_path.TestBasisPath object at 0x000001F983809E50>
    def test_cas_base_path_1_below_lower(self):
        """Path 1: Income is strictly below the lower threshold."""
        calc = PFACalculator(10000, 2024)
        # Threshold is 39600. Input 10000.
>       assert calc._get_cas_base(10000) == 0.0
E       assert 39600.0 == 0.0
E        +  where 39600.0 = _get_cas_base(10000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x000001F9838157F0>._get_cas_base
tests\test_basis_path.py:28: AssertionError
=========================== sh

200 : Job ID 5d21bbd5a0bc43fba906bf1ccb9f401f
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (15, 11), end pos: (15, 48)
operator: core/AddNot, occurrence: 1, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -12,7 +12,7 @@
         if venit_net_impozabil < lower_threshold:
             return 0.0
-        if venit_net_impozabil < upper_threshold:
+        if not venit_net_impozabil < upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
         return cas_rules["upper_base_multiplier"] * self.minimum_wage
........F
================================== FAILURES ===================================
____________ TestBasisPath.test_cas_base_path_2_between_thresholds ____________
self = <test_basis_path.TestBasisPath object at 0x000001EFF5C5DF90>
    def test_cas_base_path_2_between_thresholds(self):
        """Path 2: Income is between the lower and upper thresholds."""
        calc = PFACalculator(50000, 2024)
        # Thresholds: 39600 and 79200. Input 50000.
        min_wage = 3300
>       assert calc._get_cas_base(50000) == 12 * min_wage
E       assert 79200.0 == (12 * 3300)
E        +  where 79200.0 = _get_cas_base(50000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x000001EFF5C5DD10>._get_cas_base
tests\test_basis_path.py:35: AssertionError
=========================== short test summary inf

201 : Job ID fab7a7a243f44c8e8d7206c22291a413
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (24, 15), end pos: (24, 80)
operator: core/AddNot, occurrence: 2, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -21,7 +21,7 @@
         brackets = self.rules["pfa"]["cass_brackets"]
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
-            if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
+            if not upper is None or venit_net_impozabil <= upper * self.minimum_wage:
                 return bracket["base_multiplier"] * self.minimum_wage
         return 0.0
..............................F
================================== FAILURES ===================================
____ TestBoundaryValueAnalysis.test_pfa_cass_boundary_bracket_transitions _____
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001E80D584050>
    def test_pfa_cass_boundary_bracket_transitions(self):
        """Boundary values at CASS bracket transitions"""
        brackets = [
            (6 * 3300 - 1, 0),      # Just below first bracket
            (6 * 3300, 0),          # At first bracket boundary
            (6 * 3300 + 1, 6 * 3300), # Just above first bracket
            (12 * 3300 - 1, 6 * 3300), # Just below second bracket
            (12 * 3300, 6 * 3300), # At second bracket boundary
