202 : Job ID ad09a54d073c4e7384646d27e809727c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (24, 29), end pos: (24, 31)
operator: core/ReplaceOrWithAnd, occurrence: 0, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -21,7 +21,7 @@
         brackets = self.rules["pfa"]["cass_brackets"]
         for bracket in brackets:
             upper: Optional[float] = bracket["max_income_multiplier"]
-            if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
+            if upper is None and venit_net_impozabil <= upper * self.minimum_wage:
                 return bracket["base_multiplier"] * self.minimum_wage
         return 0.0
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000013FA63CE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
>       pfa = PFACalculator(0, 2024).calculate()
              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
src\calculator_pfa.py:39: in calculate
    cass_base = self._get_cass

203 : Job ID 3fe451ad8baa48fcaecdcb7bd2e69083
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (14, 19), end pos: (14, 22)
operator: core/NumberReplacer, occurrence: 0, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -11,7 +11,7 @@
         upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
         if venit_net_impozabil < lower_threshold:
-            return 0.0
+            return 1.0
         if venit_net_impozabil < upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
         return cas_rules["upper_base_multiplier"] * self.minimum_wage
.......F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_1_below_lower ________________
self = <test_basis_path.TestBasisPath object at 0x00000237A301DE50>
    def test_cas_base_path_1_below_lower(self):
        """Path 1: Income is strictly below the lower threshold."""
        calc = PFACalculator(10000, 2024)
        # Threshold is 39600. Input 10000.
>       assert calc._get_cas_base(10000) == 0.0
E       assert 1.0 == 0.0
E        +  where 1.0 = _get_cas_base(10000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x00000237A30257F0>._get_cas_base
tests\test_basis_path.py:28: AssertionError
=========================== short test summary info ===============

204 : Job ID 8d349ccfbe1448c5bfd984f1e86fc8c3
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (14, 19), end pos: (14, 22)
operator: core/NumberReplacer, occurrence: 1, definition_name: _get_cas_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -11,7 +11,7 @@
         upper_threshold = cas_rules["upper_multiplier"] * self.minimum_wage
         if venit_net_impozabil < lower_threshold:
-            return 0.0
+            return -1.0
         if venit_net_impozabil < upper_threshold:
             return cas_rules["lower_base_multiplier"] * self.minimum_wage
         return cas_rules["upper_base_multiplier"] * self.minimum_wage
.......F
================================== FAILURES ===================================
_______________ TestBasisPath.test_cas_base_path_1_below_lower ________________
self = <test_basis_path.TestBasisPath object at 0x000001DD75BDDE50>
    def test_cas_base_path_1_below_lower(self):
        """Path 1: Income is strictly below the lower threshold."""
        calc = PFACalculator(10000, 2024)
        # Threshold is 39600. Input 10000.
>       assert calc._get_cas_base(10000) == 0.0
E       assert -1.0 == 0.0
E        +  where -1.0 = _get_cas_base(10000)
E        +    where _get_cas_base = <calculator_pfa.PFACalculator object at 0x000001DD75BE57F0>._get_cas_base
tests\test_basis_path.py:28: AssertionError
=========================== short test summary info ============

205 : Job ID 5a9bccdf02bd4fe9bed9b778d3a686a3
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (26, 15), end pos: (26, 18)
operator: core/NumberReplacer, occurrence: 2, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -23,7 +23,7 @@
             upper: Optional[float] = bracket["max_income_multiplier"]
             if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
                 return bracket["base_multiplier"] * self.minimum_wage
-        return 0.0
+        return 1.0
     def calculate(self) -> Dict[str, float]:
         pfa_rules = self.rules["pfa"]
.......................................................F
================================== FAILURES ===================================
______ TestMutationKillers.test_kill_mutant_cass_fallback_empty_brackets ______
self = <test_mutation_analysis.TestMutationKillers object at 0x0000017DB64BED50>
monkeypatch = <_pytest.monkeypatch.MonkeyPatch object at 0x0000017DB64F08C0>
    def test_kill_mutant_cass_fallback_empty_brackets(self, monkeypatch):
        """
        Omoară mutantul Job 205 (return 0.0 → return 1.0 în _get_cass_base).
        Forțăm execuția ramurii de fallback (după buclă) prin injectarea
        unei liste goale de brackets. Bucla `for bracket in brackets` nu
        se execută deloc, și codul ajunge direct la `return 0.0`.
        CORECT:  return 0.0  → _get_cass_base() ==

206 : Job ID 647c0b237b0645e08000e318e4a730dd
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (26, 15), end pos: (26, 18)
operator: core/NumberReplacer, occurrence: 3, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -23,7 +23,7 @@
             upper: Optional[float] = bracket["max_income_multiplier"]
             if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
                 return bracket["base_multiplier"] * self.minimum_wage
-        return 0.0
+        return -1.0
     def calculate(self) -> Dict[str, float]:
         pfa_rules = self.rules["pfa"]
.......................................................F
================================== FAILURES ===================================
______ TestMutationKillers.test_kill_mutant_cass_fallback_empty_brackets ______
self = <test_mutation_analysis.TestMutationKillers object at 0x000002417F50ED50>
monkeypatch = <_pytest.monkeypatch.MonkeyPatch object at 0x000002417F5408C0>
    def test_kill_mutant_cass_fallback_empty_brackets(self, monkeypatch):
        """
        Omoară mutantul Job 205 (return 0.0 → return 1.0 în _get_cass_base).
        Forțăm execuția ramurii de fallback (după buclă) prin injectarea
        unei liste goale de brackets. Bucla `for bracket in brackets` nu
        se execută deloc, și codul ajunge direct la `return 0.0`.
        CORECT:  return 0.0  → _get_cass_base() =

207 : Job ID e954760cfa2e427c9200c15c9d8bcc95
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_pfa.py, start pos: (30, 55), end pos: (30, 58)
operator: core/NumberReplacer, occurrence: 4, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -27,7 +27,7 @@
     def calculate(self) -> Dict[str, float]:
         pfa_rules = self.rules["pfa"]
-        expense_ratio = pfa_rules.get("expense_ratio", 0.0)
+        expense_ratio = pfa_rules.get("expense_ratio", 1.0)
         cheltuieli = self.venit_brut * expense_ratio
         # Current model uses a configurable flat expense ratio.
........................................................................ [ 91%]
.......                                                                  [100%]
79 passed in 0.15s

208 : Job ID e3e874a31d794de08e5403fc69c114f0
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_pfa.py, start pos: (30, 55), end pos: (30, 58)
operator: core/NumberReplacer, occurrence: 5, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -27,7 +27,7 @@
     def calculate(self) -> Dict[str, float]:
         pfa_rules = self.rules["pfa"]
-        expense_ratio = pfa_rules.get("expense_ratio", 0.0)
+        expense_ratio = pfa_rules.get("expense_ratio", -1.0)
         cheltuieli = self.venit_brut * expense_ratio
         # Current model uses a configurable flat expense ratio.
........................................................................ [ 91%]
.......                                                                  [100%]
79 passed in 0.15s

209 : Job ID 4f1bbbe51a004df2926d46f156dc665c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (34, 64), end pos: (34, 67)
operator: core/NumberReplacer, occurrence: 6, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -31,7 +31,7 @@
         cheltuieli = self.venit_brut * expense_ratio
         # Current model uses a configurable flat expense ratio.
-        venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
+        venit_net_impozabil = max(self.venit_brut - cheltuieli, 1.0)
         cas_base = self._get_cas_base(venit_net_impozabil)
         cas = cas_base * pfa_rules["cas_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001ECF0E2A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
        pfa = PFACalculator(0, 2024).calculate()
>       assert pfa["venit_net"] == 0.0
E       assert -0.1 == 0.0
tests\test_boundary_values.py:32: AssertionError
=========================== short test summary info ===========================
FAILED tests/test_boundary_values.py::TestBoundaryValueAnalysis::test_venit_brut_boundary_zero
!

210 : Job ID d01907b621c94d3286a2206034f34785
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_pfa.py, start pos: (34, 64), end pos: (34, 67)
operator: core/NumberReplacer, occurrence: 7, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -31,7 +31,7 @@
         cheltuieli = self.venit_brut * expense_ratio
         # Current model uses a configurable flat expense ratio.
-        venit_net_impozabil = max(self.venit_brut - cheltuieli, 0.0)
+        venit_net_impozabil = max(self.venit_brut - cheltuieli, -1.0)
         cas_base = self._get_cas_base(venit_net_impozabil)
         cas = cas_base * pfa_rules["cas_rate"]
........................................................................ [ 91%]
.......                                                                  [100%]
79 passed in 0.15s

211 : Job ID af6a84be0d5d4795b024b02f9912b27a
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (42, 61), end pos: (42, 64)
operator: core/NumberReplacer, occurrence: 8, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil - cas - cass, 1.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000254C2A8E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
        assert employee["venit_net"] == 0.0
        pfa = PFACalculator(0, 2024).calculate()
>       assert pfa["venit_net"] == 0.0
E       assert -0.1 == 0.0
tests\test_boundary_values.py:32: AssertionError
=========================== short test summary info ===========================
FAILED tests/test_boundary_values.py::TestBoundaryValueAnalysis::tes

212 : Job ID 04beaa1d6c5c4b13bf22d178f5d9d231
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_pfa.py, start pos: (42, 61), end pos: (42, 64)
operator: core/NumberReplacer, occurrence: 9, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -39,7 +39,7 @@
         cass_base = self._get_cass_base(venit_net_impozabil)
         cass = cass_base * pfa_rules["cass_rate"]
-        baza_impozit = max(venit_net_impozabil - cas - cass, 0.0)
+        baza_impozit = max(venit_net_impozabil - cas - cass, -1.0)
         # If a future year sets income_tax_rate to 0.0, tax is effectively removed.
         impozit = baza_impozit * pfa_rules["income_tax_rate"]
........................................................................ [ 91%]
.......                                                                  [100%]
79 passed in 0.18s

215 : Job ID 0f72b88433414ef5a64072378ab0f675
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_pfa.py, start pos: (51, 44), end pos: (51, 45)
operator: core/NumberReplacer, occurrence: 12, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -48,7 +48,7 @@
         return {
             "venit_brut": round(self.venit_brut, 2),
-            "cheltuieli": round(cheltuieli, 2),
+            "cheltuieli": round(cheltuieli, 3),
             "venit_net_impozabil": round(venit_net_impozabil, 2),
             "cas": round(cas, 2),
             "cass": round(cass, 2),
........................................................................ [ 91%]
.......                                                                  [100%]
79 passed in 0.15s

216 : Job ID 5bbef8a9387f4f99863a90c9eaa9fac7
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_pfa.py, start pos: (51, 44), end pos: (51, 45)
operator: core/NumberReplacer, occurrence: 13, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -48,7 +48,7 @@
         return {
             "venit_brut": round(self.venit_brut, 2),
-            "cheltuieli": round(cheltuieli, 2),
+            "cheltuieli": round(cheltuieli, 1),
             "venit_net_impozabil": round(venit_net_impozabil, 2),
             "cas": round(cas, 2),
             "cass": round(cass, 2),
........................................................................ [ 91%]
.......                                                                  [100%]
79 passed in 0.15s

217 : Job ID 16dc9f655f714ea3a41ad77f7687eee0
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_pfa.py, start pos: (52, 62), end pos: (52, 63)
operator: core/NumberReplacer, occurrence: 14, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -49,7 +49,7 @@
         return {
             "venit_brut": round(self.venit_brut, 2),
             "cheltuieli": round(cheltuieli, 2),
-            "venit_net_impozabil": round(venit_net_impozabil, 2),
+            "venit_net_impozabil": round(venit_net_impozabil, 3),
             "cas": round(cas, 2),
             "cass": round(cass, 2),
             "impozit": round(impozit, 2),
........................................................................ [ 91%]
.......                                                                  [100%]
79 passed in 0.16s

218 : Job ID 6e5787fc89684b64bab11ae94e208b77
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_pfa.py, start pos: (52, 62), end pos: (52, 63)
operator: core/NumberReplacer, occurrence: 15, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -49,7 +49,7 @@
         return {
             "venit_brut": round(self.venit_brut, 2),
             "cheltuieli": round(cheltuieli, 2),
-            "venit_net_impozabil": round(venit_net_impozabil, 2),
+            "venit_net_impozabil": round(venit_net_impozabil, 1),
             "cas": round(cas, 2),
             "cass": round(cass, 2),
             "impozit": round(impozit, 2),
........................................................................ [ 91%]
.......                                                                  [100%]
79 passed in 0.19s

219 : Job ID acf8f587749447659d5f7cf10d039797
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_pfa.py, start pos: (53, 30), end pos: (53, 31)
operator: core/NumberReplacer, occurrence: 16, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -50,7 +50,7 @@
             "venit_brut": round(self.venit_brut, 2),
             "cheltuieli": round(cheltuieli, 2),
             "venit_net_impozabil": round(venit_net_impozabil, 2),
-            "cas": round(cas, 2),
+            "cas": round(cas, 3),
             "cass": round(cass, 2),
             "impozit": round(impozit, 2),
             "total_taxe": round(total_taxe, 2),
........................................................................ [ 91%]
.......                                                                  [100%]
79 passed in 0.15s

220 : Job ID 4546d5347a194e71b25f2f4d1c943640
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_pfa.py, start pos: (53, 30), end pos: (53, 31)
operator: core/NumberReplacer, occurrence: 17, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -50,7 +50,7 @@
             "venit_brut": round(self.venit_brut, 2),
             "cheltuieli": round(cheltuieli, 2),
             "venit_net_impozabil": round(venit_net_impozabil, 2),
-            "cas": round(cas, 2),
+            "cas": round(cas, 1),
             "cass": round(cass, 2),
             "impozit": round(impozit, 2),
             "total_taxe": round(total_taxe, 2),
........................................................................ [ 91%]
.......                                                                  [100%]
79 passed in 0.16s

229 : Job ID b26008aaec62401ba8eb2e5d45d2cd33
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_pfa.py, start pos: (22, 23), end pos: (22, 31)
operator: core/ZeroIterationForLoop, occurrence: 0, definition_name: _get_cass_base
--- mutation diff ---
--- asrc\calculator_pfa.py
+++ bsrc\calculator_pfa.py
@@ -19,7 +19,7 @@
     def _get_cass_base(self, venit_net_impozabil: float) -> float:
         # CASS uses progressive brackets configured per fiscal year.
         brackets = self.rules["pfa"]["cass_brackets"]
-        for bracket in brackets:
+        for bracket in []:
             upper: Optional[float] = bracket["max_income_multiplier"]
             if upper is None or venit_net_impozabil <= upper * self.minimum_wage:
                 return bracket["base_multiplier"] * self.minimum_wage
..............................F
================================== FAILURES ===================================
____ TestBoundaryValueAnalysis.test_pfa_cass_boundary_bracket_transitions _____
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001766FD74050>
    def test_pfa_cass_boundary_bracket_transitions(self):
        """Boundary values at CASS bracket transitions"""
        brackets = [
            (6 * 3300 - 1, 0),      # Just below first bracket
            (6 * 3300, 0),          # At first bracket boundary
            (6 * 3300 + 1, 6 * 3300), # Just above first bracket
            (12 * 3300 - 1, 6 * 3300), # Just below second
