1 : Job ID 909f489468b04c5f8ea929fa8982e352
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (15, 25), end pos: (15, 26)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -12,7 +12,7 @@
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas - cass + impozit
         venit_net = self.venit_brut - total_taxe
         return {
...........................................................F
================================== FAILURES ===================================
__________ TestStatementCoverage.test_employee_calculate_normal_case __________
self = <test_statement_coverage.TestStatementCoverage object at 0x0000023A4874F5C0>
    def test_employee_calculate_normal_case(self):
        """Cover normal calculation path"""
        calc = EmployeeCalculator(100000, 2024)
        result = calc.calculate()
        assert result["cas"] == 25000.0
        assert result["cass"] == 10000.0
        assert result["impozit"] == 6500.0
>       assert result["venit_net"] == 58500.0
E       assert 78500.0 == 58500.0
tests\test_statement_coverage.py:46: AssertionError
=====================

2 : Job ID 96c23daebc8440da84747b227eb3b6ad
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (15, 32), end pos: (15, 33)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -12,7 +12,7 @@
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas + cass - impozit
         venit_net = self.venit_brut - total_taxe
         return {
...........................................................F
================================== FAILURES ===================================
__________ TestStatementCoverage.test_employee_calculate_normal_case __________
self = <test_statement_coverage.TestStatementCoverage object at 0x000001CCEC40F5C0>
    def test_employee_calculate_normal_case(self):
        """Cover normal calculation path"""
        calc = EmployeeCalculator(100000, 2024)
        result = calc.calculate()
        assert result["cas"] == 25000.0
        assert result["cass"] == 10000.0
        assert result["impozit"] == 6500.0
>       assert result["venit_net"] == 58500.0
E       assert 71500.0 == 58500.0
tests\test_statement_coverage.py:46: AssertionError
=====================

3 : Job ID afa01ba92f204158afe5a00315e3b42d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (15, 25), end pos: (15, 26)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -12,7 +12,7 @@
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas * cass + impozit
         venit_net = self.venit_brut - total_taxe
         return {
............................................F
================================== FAILURES ===================================
______ TestEquivalencePartitioning.test_venit_brut_valid_small_positive _______
self = <test_equivalence_partitioning.TestEquivalencePartitioning object at 0x00000226CC49F490>
    def test_venit_brut_valid_small_positive(self):
        """Test valid equivalence class: small positive venit_brut"""
        # Small income, below minimum wage thresholds
        venit = 10000  # Less than 12 * 3300 = 39600 for 2024
        employee = EmployeeCalculator(venit, 2024).calculate()
>       assert employee["venit_net"] > 0
E       assert -2490650.0 > 0
tests\test_equivalence_partitioning.py:49: AssertionError
=============================

4 : Job ID 9e902a3402504625a7b587827eb05d4d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (15, 32), end pos: (15, 33)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -12,7 +12,7 @@
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas + cass * impozit
         venit_net = self.venit_brut - total_taxe
         return {
............................................F
================================== FAILURES ===================================
______ TestEquivalencePartitioning.test_venit_brut_valid_small_positive _______
self = <test_equivalence_partitioning.TestEquivalencePartitioning object at 0x000001D2B298F490>
    def test_venit_brut_valid_small_positive(self):
        """Test valid equivalence class: small positive venit_brut"""
        # Small income, below minimum wage thresholds
        venit = 10000  # Less than 12 * 3300 = 39600 for 2024
        employee = EmployeeCalculator(venit, 2024).calculate()
>       assert employee["venit_net"] > 0
E       assert -642500.0 > 0
tests\test_equivalence_partitioning.py:49: AssertionError
==============================

5 : Job ID 11442b74f11f4e55a5cd24fabeab50f3
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (15, 25), end pos: (15, 26)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -12,7 +12,7 @@
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas / cass + impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001B08C99E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000001B08C99D950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCalculat

6 : Job ID 58660ae2beaf4ed49b3c5a756380f7b5
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (15, 32), end pos: (15, 33)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -12,7 +12,7 @@
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas + cass / impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001226085A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x0000012260859950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCalculat

7 : Job ID f120ff6bb3a5497a8eee01ba62075ccf
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (15, 25), end pos: (15, 26)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -12,7 +12,7 @@
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas // cass + impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002B05162E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000002B05162D950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCa

8 : Job ID 8d8682bbc22b4c3c83c2df43d1cdca28
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (15, 32), end pos: (15, 33)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -12,7 +12,7 @@
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas + cass // impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000023611DFE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x0000023611DFD950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCa

9 : Job ID 4c96eaed737f483ea151e7e4c6f4c19a
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (15, 25), end pos: (15, 26)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -12,7 +12,7 @@
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas % cass + impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002557CA2E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000002557CA2D950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCalculat

10 : Job ID 200f80be9c95466bb4f2c5a149fa4607
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (15, 32), end pos: (15, 33)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -12,7 +12,7 @@
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas + cass % impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000010F67A5E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x0000010F67A5D950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCalcula

11 : Job ID e982acbe2ea8406882c3760496240689
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (15, 25), end pos: (15, 26)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -12,7 +12,7 @@
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas ** cass + impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001F4AF56E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
>       assert employee["venit_net"] == 0.0
E       assert -1.0 == 0.0
tests\test_boundary_values.py:29: AssertionError
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test_mutation_analysis.py:126: PytestUnknownMarkWarning: Unknown pytest.mark.mutation_killer - is

12 : Job ID 3ec4efa2440d42df82c043cfc5d6eefe
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (15, 32), end pos: (15, 33)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -12,7 +12,7 @@
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas + cass ** impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002A4154AE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
>       assert employee["venit_net"] == 0.0
E       assert -1.0 == 0.0
tests\test_boundary_values.py:29: AssertionError
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test_mutation_analysis.py:126: PytestUnknownMarkWarning: Unknown pytest.mark.mutation_killer - is

13 : Job ID e68065a09380486196a402a78dbee556
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (15, 25), end pos: (15, 26)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -12,7 +12,7 @@
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas >> cass + impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001835165E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000001835165D950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCal

14 : Job ID 1d55d09ad5054b628ad95a7aa0d6a979
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (15, 32), end pos: (15, 33)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -12,7 +12,7 @@
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas + cass >> impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001FD142DE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000001FD142DD950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCal

15 : Job ID 5727311fc257403695bbc1467a5cbca5
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (15, 25), end pos: (15, 26)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -12,7 +12,7 @@
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas << cass + impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001A8669AE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000001A8669AD950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCal

16 : Job ID 939168173bbe40b3971e01c01811b83d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (15, 32), end pos: (15, 33)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -12,7 +12,7 @@
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas + cass << impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000012E21D4E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x0000012E21D4D950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCal

17 : Job ID 8990c745b2294ffab1e43ba7e05b3a81
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (15, 25), end pos: (15, 26)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -12,7 +12,7 @@
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas | cass + impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001D0F88DE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000001D0F88DD950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCalcu

18 : Job ID a702f398faaf405d95c7425bd462caa8
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (15, 32), end pos: (15, 33)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -12,7 +12,7 @@
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas + cass | impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000237BA08E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x00000237BA08D950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCalcu

19 : Job ID 3ed80db2dc624677b1f90114f1e9b4b2
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (15, 25), end pos: (15, 26)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -12,7 +12,7 @@
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas & cass + impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001A6B50CE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000001A6B50CD950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCalc
