20 : Job ID eadfb2f84a93428396b8d64391608fd3
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (15, 32), end pos: (15, 33)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -12,7 +12,7 @@
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas + cass & impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001E1DFD2E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000001E1DFD2D950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCalc

21 : Job ID aa64f24c271b48b1806db5deda516147
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (15, 25), end pos: (15, 26)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -12,7 +12,7 @@
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas ^ cass + impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000025952CAE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x0000025952CAD950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCalc

22 : Job ID 70b663c6722b470e9bff4c4da1f5ecc9
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (15, 32), end pos: (15, 33)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -12,7 +12,7 @@
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
-        total_taxe = cas + cass + impozit
+        total_taxe = cas + cass ^ impozit
         venit_net = self.venit_brut - total_taxe
         return {
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000248DE7EA350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x00000248DE7E9950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCalc

23 : Job ID 199dc3d52db34323916519512cb3b0e6
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 46), end pos: (13, 47)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut + cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
...........................................................F
================================== FAILURES ===================================
__________ TestStatementCoverage.test_employee_calculate_normal_case __________
self = <test_statement_coverage.TestStatementCoverage object at 0x000002BA0E21F5C0>
    def test_employee_calculate_normal_case(self):
        """Cover normal calculation path"""
        calc = EmployeeCalculator(100000, 2024)
        result = calc.calculate()
        assert result["cas"] == 25000.0
        assert result["cass"] == 10000.0
>       assert result["impozit"] == 6500.0
E       assert 11500.0 == 6500.0
tests\test_s

24 : Job ID f6f36a88aede463b91304271447a330b
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 52), end pos: (13, 53)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut - cas + cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
...........................................................F
================================== FAILURES ===================================
__________ TestStatementCoverage.test_employee_calculate_normal_case __________
self = <test_statement_coverage.TestStatementCoverage object at 0x0000024781D135C0>
    def test_employee_calculate_normal_case(self):
        """Cover normal calculation path"""
        calc = EmployeeCalculator(100000, 2024)
        result = calc.calculate()
        assert result["cas"] == 25000.0
        assert result["cass"] == 10000.0
>       assert result["impozit"] == 6500.0
E       assert 8500.0 == 6500.0
tests\test_st

25 : Job ID 5d9b4b9da52d4a66956d19a95033d5b0
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (16, 36), end pos: (16, 37)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -13,7 +13,7 @@
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
-        venit_net = self.venit_brut - total_taxe
+        venit_net = self.venit_brut + total_taxe
         return {
             "venit_brut": round(self.venit_brut, 2),
...........................................................F
================================== FAILURES ===================================
__________ TestStatementCoverage.test_employee_calculate_normal_case __________
self = <test_statement_coverage.TestStatementCoverage object at 0x00000240B6F935C0>
    def test_employee_calculate_normal_case(self):
        """Cover normal calculation path"""
        calc = EmployeeCalculator(100000, 2024)
        result = calc.calculate()
        assert result["cas"] == 25000.0
        assert result["cass"] == 10000.0
        assert result["impozit"] == 6500.0
>       assert result["venit_net"] == 58500.0
E       assert 141500.0 == 58500.0
tests\test_statement_coverage.py:46: AssertionError
==============================

26 : Job ID f14c03c9b0194836ab07ec574bc30343
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 46), end pos: (13, 47)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut * cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
............................................F
================================== FAILURES ===================================
______ TestEquivalencePartitioning.test_venit_brut_valid_small_positive _______
self = <test_equivalence_partitioning.TestEquivalencePartitioning object at 0x0000016BC41FF490>
    def test_venit_brut_valid_small_positive(self):
        """Test valid equivalence class: small positive venit_brut"""
        # Small income, below minimum wage thresholds
        venit = 10000  # Less than 12 * 3300 = 39600 for 2024
        employee = EmployeeCalculator(venit, 2024).calculate()
>       assert employee["venit_net"] > 0
E       a

27 : Job ID 40e800d49faa462b81ded572381716da
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 52), end pos: (13, 53)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut - cas * cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
...........................................................F
================================== FAILURES ===================================
__________ TestStatementCoverage.test_employee_calculate_normal_case __________
self = <test_statement_coverage.TestStatementCoverage object at 0x000001CA0250F5C0>
    def test_employee_calculate_normal_case(self):
        """Cover normal calculation path"""
        calc = EmployeeCalculator(100000, 2024)
        result = calc.calculate()
        assert result["cas"] == 25000.0
        assert result["cass"] == 10000.0
>       assert result["impozit"] == 6500.0
E       assert 0.0 == 6500.0
tests\test_state

28 : Job ID 1f9cf6f484104897b94f11a2d0b9b221
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (16, 36), end pos: (16, 37)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -13,7 +13,7 @@
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
-        venit_net = self.venit_brut - total_taxe
+        venit_net = self.venit_brut * total_taxe
         return {
             "venit_brut": round(self.venit_brut, 2),
.................F
================================== FAILURES ===================================
_____ TestBoundaryValueAnalysis.test_venit_brut_boundary_just_above_zero ______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001D924E12B10>
    def test_venit_brut_boundary_just_above_zero(self):
        """Boundary: just above zero"""
        employee = EmployeeCalculator(0.01, 2024).calculate()
>       assert employee["venit_net"] > 0
E       assert 0.0 > 0
tests\test_boundary_values.py:37: AssertionError
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test_mutation_analysis.py:126: PytestUnknownMarkWarning: Unknown pytest.mark.mutation_killer - is

29 : Job ID 2aed281705f14aefb9026d671cb72145
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 46), end pos: (13, 47)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut / cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000121C6BEE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x00000121C6BED950

30 : Job ID ab84d475bbd54a9db2ba0e20b62687b3
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 52), end pos: (13, 53)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut - cas / cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002279059E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000002279059D950

31 : Job ID 0556337a53df440c9ae0426e4fd3d4dc
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (16, 36), end pos: (16, 37)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -13,7 +13,7 @@
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
-        venit_net = self.venit_brut - total_taxe
+        venit_net = self.venit_brut / total_taxe
         return {
             "venit_brut": round(self.venit_brut, 2),
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002218BEDE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000002218BEDD950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCalculator base cl

32 : Job ID 6f64bdb189ce4e4ca5b60a339176080b
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 46), end pos: (13, 47)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut // cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000110C314E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x00000110C3

33 : Job ID 054d3befb6224f3ab4c8e3c5d3f98b91
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 52), end pos: (13, 53)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut - cas // cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002482B34E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000002482B

34 : Job ID a98a4ff6dcf94d438347f10b339649d5
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (16, 36), end pos: (16, 37)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -13,7 +13,7 @@
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
-        venit_net = self.venit_brut - total_taxe
+        venit_net = self.venit_brut // total_taxe
         return {
             "venit_brut": round(self.venit_brut, 2),
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001AAA8B5A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000001AAA8B59950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCalculator b

35 : Job ID 2b168b043ef748e2968c724853aac092
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 46), end pos: (13, 47)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut % cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001ACF675E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000001ACF675D950

36 : Job ID 51a6485f55a045c3b7718c1e352e8913
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 52), end pos: (13, 53)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut - cas % cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002778D3EA350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000002778D3E9950

37 : Job ID 0b42034f5e334cfe893fd4edad8386a8
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (16, 36), end pos: (16, 37)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -13,7 +13,7 @@
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
-        venit_net = self.venit_brut - total_taxe
+        venit_net = self.venit_brut % total_taxe
         return {
             "venit_brut": round(self.venit_brut, 2),
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002A94E88E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000002A94E88D950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCalculator base cl

38 : Job ID a2de4580a830465eb5d1db22fe5cb82a
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 46), end pos: (13, 47)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut ** cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001F9C598E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
>       assert employee["venit_net"] == 0.0
E       assert -0.1 == 0.0
tests\test_boundary_values.py:29: AssertionError
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibu
