39 : Job ID 8229d14beccd4ea7bffdf040d23d6ed0
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 52), end pos: (13, 53)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut - cas ** cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
...................F
================================== FAILURES ===================================
________ TestBoundaryValueAnalysis.test_anul_fiscal_boundary_min_year _________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001D686880050>
    def test_anul_fiscal_boundary_min_year(self):
        """Boundary: minimum available year"""
        min_year = min(get_available_years())
>       employee = EmployeeCalculator(100000, min_year).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:53: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

40 : Job ID 02d245d9ab8549c2ac64158eeab9434f
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (16, 36), end pos: (16, 37)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -13,7 +13,7 @@
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
-        venit_net = self.venit_brut - total_taxe
+        venit_net = self.venit_brut ** total_taxe
         return {
             "venit_brut": round(self.venit_brut, 2),
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000018C6EBBE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
>       assert employee["venit_net"] == 0.0
E       assert 1.0 == 0.0
tests\test_boundary_values.py:29: AssertionError
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test_mutation_analysis.py:126: PytestUnknownMarkWarning: Unknown pytest.mark.mutation_killer - is this a typo

41 : Job ID fa682e9f7e884ecb94d94f0417af74f3
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 46), end pos: (13, 47)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut >> cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002A49E5BE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000002A49E5B

42 : Job ID 80ac767c0fba4f15b0d0c04c635145fe
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 52), end pos: (13, 53)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut - cas >> cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000018735CCE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x0000018735CC

43 : Job ID bde1678da4884f4fa03c5cabd34c4b0d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (16, 36), end pos: (16, 37)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -13,7 +13,7 @@
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
-        venit_net = self.venit_brut - total_taxe
+        venit_net = self.venit_brut >> total_taxe
         return {
             "venit_brut": round(self.venit_brut, 2),
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000027CA6EFE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x0000027CA6EFD950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCalculator bas

44 : Job ID 4766bc99e1a243129527a4366c3fdbd9
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 46), end pos: (13, 47)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut << cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000277B909A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x00000277B909

45 : Job ID 8e8d3a51c1674503834b6936cebeabd9
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 52), end pos: (13, 53)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut - cas << cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000022604DEA350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x0000022604DE

46 : Job ID 716b1fc536654434be999fd33472c4ed
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (16, 36), end pos: (16, 37)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -13,7 +13,7 @@
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
-        venit_net = self.venit_brut - total_taxe
+        venit_net = self.venit_brut << total_taxe
         return {
             "venit_brut": round(self.venit_brut, 2),
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001449C5FE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000001449C5FD950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCalculator bas

47 : Job ID 2f39da34828b4526a29b135adf2a13b2
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 46), end pos: (13, 47)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut | cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000019A477AE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x0000019A477AD9

48 : Job ID 48bfc356704a42a28091f7615e14ba77
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 52), end pos: (13, 53)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut - cas | cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001CBA8FBE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000001CBA8FBD9

49 : Job ID 1c22f79ac1a84aa4827d9e2594fc0bca
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (16, 36), end pos: (16, 37)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -13,7 +13,7 @@
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
-        venit_net = self.venit_brut - total_taxe
+        venit_net = self.venit_brut | total_taxe
         return {
             "venit_brut": round(self.venit_brut, 2),
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000202ACC6E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x00000202ACC6D950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCalculator base

50 : Job ID 7515e3ba59d64ae2bdb18024e566e441
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 46), end pos: (13, 47)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut & cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000019C6464A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x0000019C64649

51 : Job ID 92628ebbf2f945f99968f265622a648f
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 52), end pos: (13, 53)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut - cas & cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001F61573E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000001F61573D

52 : Job ID ca9d3ed3f5ac46418e301db68ac6beef
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (16, 36), end pos: (16, 37)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -13,7 +13,7 @@
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
-        venit_net = self.venit_brut - total_taxe
+        venit_net = self.venit_brut & total_taxe
         return {
             "venit_brut": round(self.venit_brut, 2),
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001E923CFE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000001E923CFD950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCalculator base

53 : Job ID 93b15682fedc470e85e319f011b5574e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 46), end pos: (13, 47)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut ^ cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002B094A9E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000002B094A9D

54 : Job ID 18122f62a0674fbe843a82baf36adb50
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 52), end pos: (13, 53)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut - cas ^ cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000221ACB0E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x00000221ACB0D

55 : Job ID 0320a8f753c448afa3218cfbf3814087
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (16, 36), end pos: (16, 37)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -13,7 +13,7 @@
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
-        venit_net = self.venit_brut - total_taxe
+        venit_net = self.venit_brut ^ total_taxe
         return {
             "venit_brut": round(self.venit_brut, 2),
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000022DAFF1E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x0000022DAFF1D950>
    def calculate(self) -> Dict[str, float]:
        # Rates are loaded from yearly config via TaxCalculator base

56 : Job ID dc171697ffa849ff9fe8f10ac8dd79e7
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (10, 30), end pos: (10, 31)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -7,7 +7,7 @@
     def calculate(self) -> Dict[str, float]:
         # Rates are loaded from yearly config via TaxCalculator base class.
         rules = self.rules["employee"]
-        cas = self.venit_brut * rules["cas_rate"]
+        cas = self.venit_brut + rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002A54523E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
>       assert employee["venit_net"] == 0.0
E       assert -0.25 == 0.0
tests\test_boundary_values.py:29: AssertionError
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tes

57 : Job ID f958fea2df3c4e8da62f0dd1a966f23e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (11, 31), end pos: (11, 32)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -8,7 +8,7 @@
         # Rates are loaded from yearly config via TaxCalculator base class.
         rules = self.rules["employee"]
         cas = self.venit_brut * rules["cas_rate"]
-        cass = self.venit_brut * rules["cass_rate"]
+        cass = self.venit_brut + rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000025EEE9FE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
>       assert employee["venit_net"] == 0.0
E       assert -0.1 == 0.0
tests\test_boundary_values.py:29: AssertionError
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
