58 : Job ID 4cac96e1c84242d6827cc17e28fc264c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (14, 34), end pos: (14, 35)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -11,7 +11,7 @@
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
-        impozit = baza_impozabila * rules["income_tax_rate"]
+        impozit = baza_impozabila + rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002290FC6E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
>       assert employee["venit_net"] == 0.0
E       assert -0.1 == 0.0
tests\test_boundary_values.py:29: AssertionError
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test_mutation_analysis.py:126: PytestUnknown

59 : Job ID 9c1335d8718440fb9e79e045000bba51
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (10, 30), end pos: (10, 31)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -7,7 +7,7 @@
     def calculate(self) -> Dict[str, float]:
         # Rates are loaded from yearly config via TaxCalculator base class.
         rules = self.rules["employee"]
-        cas = self.venit_brut * rules["cas_rate"]
+        cas = self.venit_brut - rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000013CCF5DE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
>       assert employee["venit_net"] == 0.0
E       assert 0.23 == 0.0
tests\test_boundary_values.py:29: AssertionError
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\test

60 : Job ID 1c1cb946a4584a34a1b65aa9142afe20
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (11, 31), end pos: (11, 32)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -8,7 +8,7 @@
         # Rates are loaded from yearly config via TaxCalculator base class.
         rules = self.rules["employee"]
         cas = self.venit_brut * rules["cas_rate"]
-        cass = self.venit_brut * rules["cass_rate"]
+        cass = self.venit_brut - rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000204C0CEE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
>       assert employee["venit_net"] == 0.0
E       assert 0.09 == 0.0
tests\test_boundary_values.py:29: AssertionError
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126

61 : Job ID a36a9f5aff144a7e9f25b2fc3abd6cc3
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (14, 34), end pos: (14, 35)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -11,7 +11,7 @@
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
-        impozit = baza_impozabila * rules["income_tax_rate"]
+        impozit = baza_impozabila - rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001FC9F6AE350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
>       assert employee["venit_net"] == 0.0
E       assert 0.1 == 0.0
tests\test_boundary_values.py:29: AssertionError
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test_mutation_analysis.py:126: PytestUnknownM

62 : Job ID b6eb12d057094e3b812a852dc2d69f3d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (10, 30), end pos: (10, 31)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -7,7 +7,7 @@
     def calculate(self) -> Dict[str, float]:
         # Rates are loaded from yearly config via TaxCalculator base class.
         rules = self.rules["employee"]
-        cas = self.venit_brut * rules["cas_rate"]
+        cas = self.venit_brut / rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
.................F
================================== FAILURES ===================================
_____ TestBoundaryValueAnalysis.test_venit_brut_boundary_just_above_zero ______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001DD812DEB10>
    def test_venit_brut_boundary_just_above_zero(self):
        """Boundary: just above zero"""
        employee = EmployeeCalculator(0.01, 2024).calculate()
>       assert employee["venit_net"] > 0
E       assert -0.03 > 0
tests\test_boundary_values.py:37: AssertionError
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\un

63 : Job ID 66d6b26672ba4ef7b31c8d256ab12b5d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (11, 31), end pos: (11, 32)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -8,7 +8,7 @@
         # Rates are loaded from yearly config via TaxCalculator base class.
         rules = self.rules["employee"]
         cas = self.venit_brut * rules["cas_rate"]
-        cass = self.venit_brut * rules["cass_rate"]
+        cass = self.venit_brut / rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
.................F
================================== FAILURES ===================================
_____ TestBoundaryValueAnalysis.test_venit_brut_boundary_just_above_zero ______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002385044EB10>
    def test_venit_brut_boundary_just_above_zero(self):
        """Boundary: just above zero"""
        employee = EmployeeCalculator(0.01, 2024).calculate()
>       assert employee["venit_net"] > 0
E       assert -0.09 > 0
tests\test_boundary_values.py:37: AssertionError
============================== warnings summary ===============================
tests\test_mutation_analys

64 : Job ID bc172cf5560f48239188f2d5dafb2c53
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (14, 34), end pos: (14, 35)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -11,7 +11,7 @@
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
-        impozit = baza_impozabila * rules["income_tax_rate"]
+        impozit = baza_impozabila / rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
.................F
================================== FAILURES ===================================
_____ TestBoundaryValueAnalysis.test_venit_brut_boundary_just_above_zero ______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001D8205D2B10>
    def test_venit_brut_boundary_just_above_zero(self):
        """Boundary: just above zero"""
        employee = EmployeeCalculator(0.01, 2024).calculate()
>       assert employee["venit_net"] > 0
E       assert -0.06 > 0
tests\test_boundary_values.py:37: AssertionError
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test_mutation_analysis.py:126:

65 : Job ID 39e1f37b703a44c9bc2bd73149d6d6c0
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (10, 30), end pos: (10, 31)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -7,7 +7,7 @@
     def calculate(self) -> Dict[str, float]:
         # Rates are loaded from yearly config via TaxCalculator base class.
         rules = self.rules["employee"]
-        cas = self.venit_brut * rules["cas_rate"]
+        cas = self.venit_brut // rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
............................................F
================================== FAILURES ===================================
______ TestEquivalencePartitioning.test_venit_brut_valid_small_positive _______
self = <test_equivalence_partitioning.TestEquivalencePartitioning object at 0x000001729DB03490>
    def test_venit_brut_valid_small_positive(self):
        """Test valid equivalence class: small positive venit_brut"""
        # Small income, below minimum wage thresholds
        venit = 10000  # Less than 12 * 3300 = 39600 for 2024
        employee = EmployeeCalculator(venit, 2024).calculate()
>       assert employee["venit_net"] > 0
E       asse

66 : Job ID 57a66dce720d464da23a085992acb83b
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (11, 31), end pos: (11, 32)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -8,7 +8,7 @@
         # Rates are loaded from yearly config via TaxCalculator base class.
         rules = self.rules["employee"]
         cas = self.venit_brut * rules["cas_rate"]
-        cass = self.venit_brut * rules["cass_rate"]
+        cass = self.venit_brut // rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
............................................F
================================== FAILURES ===================================
______ TestEquivalencePartitioning.test_venit_brut_valid_small_positive _______
self = <test_equivalence_partitioning.TestEquivalencePartitioning object at 0x00000120F8FBF490>
    def test_venit_brut_valid_small_positive(self):
        """Test valid equivalence class: small positive venit_brut"""
        # Small income, below minimum wage thresholds
        venit = 10000  # Less than 12 * 3300 = 39600 for 2024
        employee = EmployeeCalculator(venit, 2024).calculate()
>       assert employee["venit_net"]

67 : Job ID 81feba0acfe441ed8209b057e7c23c40
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (14, 34), end pos: (14, 35)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -11,7 +11,7 @@
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
-        impozit = baza_impozabila * rules["income_tax_rate"]
+        impozit = baza_impozabila // rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
......................F
================================== FAILURES ===================================
________ TestBoundaryValueAnalysis.test_anul_fiscal_boundary_max_year _________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001DDBA22B350>
    def test_anul_fiscal_boundary_max_year(self):
        """Boundary: maximum available year"""
        max_year = max(get_available_years())
>       employee = EmployeeCalculator(100000, max_year).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:80: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCa

68 : Job ID c5aa1bd4ab994e3abe4e9840eaabcb58
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (10, 30), end pos: (10, 31)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -7,7 +7,7 @@
     def calculate(self) -> Dict[str, float]:
         # Rates are loaded from yearly config via TaxCalculator base class.
         rules = self.rules["employee"]
-        cas = self.venit_brut * rules["cas_rate"]
+        cas = self.venit_brut % rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
.................F
================================== FAILURES ===================================
_____ TestBoundaryValueAnalysis.test_venit_brut_boundary_just_above_zero ______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000027CEBACEB10>
    def test_venit_brut_boundary_just_above_zero(self):
        """Boundary: just above zero"""
        employee = EmployeeCalculator(0.01, 2024).calculate()
>       assert employee["venit_net"] > 0
E       assert -0.0 > 0
tests\test_boundary_values.py:37: AssertionError
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\uni

69 : Job ID 27329904a03f4a16ac55552df3f95d2a
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (11, 31), end pos: (11, 32)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -8,7 +8,7 @@
         # Rates are loaded from yearly config via TaxCalculator base class.
         rules = self.rules["employee"]
         cas = self.venit_brut * rules["cas_rate"]
-        cass = self.venit_brut * rules["cass_rate"]
+        cass = self.venit_brut % rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
.................F
================================== FAILURES ===================================
_____ TestBoundaryValueAnalysis.test_venit_brut_boundary_just_above_zero ______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000021B3736EB10>
    def test_venit_brut_boundary_just_above_zero(self):
        """Boundary: just above zero"""
        employee = EmployeeCalculator(0.01, 2024).calculate()
>       assert employee["venit_net"] > 0
E       assert -0.0 > 0
tests\test_boundary_values.py:37: AssertionError
============================== warnings summary ===============================
tests\test_mutation_analysi

70 : Job ID 63bd5d8ba6264f80b2cd970e13e15246
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (14, 34), end pos: (14, 35)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -11,7 +11,7 @@
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
-        impozit = baza_impozabila * rules["income_tax_rate"]
+        impozit = baza_impozabila % rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
.................F
================================== FAILURES ===================================
_____ TestBoundaryValueAnalysis.test_venit_brut_boundary_just_above_zero ______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002093FACEB10>
    def test_venit_brut_boundary_just_above_zero(self):
        """Boundary: just above zero"""
        employee = EmployeeCalculator(0.01, 2024).calculate()
>       assert employee["venit_net"] > 0
E       assert 0.0 > 0
tests\test_boundary_values.py:37: AssertionError
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test_mutation_analysis.py:126: Py

71 : Job ID 8aa9d00020a54bee9cf1761bfc01e07d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (10, 30), end pos: (10, 31)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -7,7 +7,7 @@
     def calculate(self) -> Dict[str, float]:
         # Rates are loaded from yearly config via TaxCalculator base class.
         rules = self.rules["employee"]
-        cas = self.venit_brut * rules["cas_rate"]
+        cas = self.venit_brut ** rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
.................F
================================== FAILURES ===================================
_____ TestBoundaryValueAnalysis.test_venit_brut_boundary_just_above_zero ______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000023872782B10>
    def test_venit_brut_boundary_just_above_zero(self):
        """Boundary: just above zero"""
        employee = EmployeeCalculator(0.01, 2024).calculate()
>       assert employee["venit_net"] > 0
E       assert -0.31 > 0
tests\test_boundary_values.py:37: AssertionError
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\u

72 : Job ID eb10d2eadb084290a0fa02dbb30755bb
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (11, 31), end pos: (11, 32)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -8,7 +8,7 @@
         # Rates are loaded from yearly config via TaxCalculator base class.
         rules = self.rules["employee"]
         cas = self.venit_brut * rules["cas_rate"]
-        cass = self.venit_brut * rules["cass_rate"]
+        cass = self.venit_brut ** rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
.................F
================================== FAILURES ===================================
_____ TestBoundaryValueAnalysis.test_venit_brut_boundary_just_above_zero ______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002EAC671EB10>
    def test_venit_brut_boundary_just_above_zero(self):
        """Boundary: just above zero"""
        employee = EmployeeCalculator(0.01, 2024).calculate()
>       assert employee["venit_net"] > 0
E       assert -0.62 > 0
tests\test_boundary_values.py:37: AssertionError
============================== warnings summary ===============================
tests\test_mutation_analy

73 : Job ID d0285b74d72d461498c7e0974ac5c01a
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (14, 34), end pos: (14, 35)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -11,7 +11,7 @@
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
-        impozit = baza_impozabila * rules["income_tax_rate"]
+        impozit = baza_impozabila ** rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
.................F
================================== FAILURES ===================================
_____ TestBoundaryValueAnalysis.test_venit_brut_boundary_just_above_zero ______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001B514EAEB10>
    def test_venit_brut_boundary_just_above_zero(self):
        """Boundary: just above zero"""
        employee = EmployeeCalculator(0.01, 2024).calculate()
>       assert employee["venit_net"] > 0
E       assert -0.6 > 0
tests\test_boundary_values.py:37: AssertionError
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test_mutation_analysis.py:126:

74 : Job ID acf62542f7fc493994aee1d808d2f2f5
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (10, 30), end pos: (10, 31)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -7,7 +7,7 @@
     def calculate(self) -> Dict[str, float]:
         # Rates are loaded from yearly config via TaxCalculator base class.
         rules = self.rules["employee"]
-        cas = self.venit_brut * rules["cas_rate"]
+        cas = self.venit_brut >> rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002156284A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x0000021562849950>

75 : Job ID e617bd43af6445f2b8d548c8cb0b2750
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (11, 31), end pos: (11, 32)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -8,7 +8,7 @@
         # Rates are loaded from yearly config via TaxCalculator base class.
         rules = self.rules["employee"]
         cas = self.venit_brut * rules["cas_rate"]
-        cass = self.venit_brut * rules["cass_rate"]
+        cass = self.venit_brut >> rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001DA75D4A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000

76 : Job ID 8dab1746a94f4994b46b633c90d10c4e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (14, 34), end pos: (14, 35)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -11,7 +11,7 @@
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
-        impozit = baza_impozabila * rules["income_tax_rate"]
+        impozit = baza_impozabila >> rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002470300A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x0000024703009950>
    def calculate(self) -> Dict[str, float]:
