77 : Job ID bee21e4f518044bf8f8d2703bf849306
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (10, 30), end pos: (10, 31)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -7,7 +7,7 @@
     def calculate(self) -> Dict[str, float]:
         # Rates are loaded from yearly config via TaxCalculator base class.
         rules = self.rules["employee"]
-        cas = self.venit_brut * rules["cas_rate"]
+        cas = self.venit_brut << rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002626F52E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000002626F52D950>

78 : Job ID 2c88ca717f4a45a8a86dc80b8a86398d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (11, 31), end pos: (11, 32)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -8,7 +8,7 @@
         # Rates are loaded from yearly config via TaxCalculator base class.
         rules = self.rules["employee"]
         cas = self.venit_brut * rules["cas_rate"]
-        cass = self.venit_brut * rules["cass_rate"]
+        cass = self.venit_brut << rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000015B9906E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000

79 : Job ID 159c6d43fd6f418b9edda1bacb9523e7
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (14, 34), end pos: (14, 35)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -11,7 +11,7 @@
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
-        impozit = baza_impozabila * rules["income_tax_rate"]
+        impozit = baza_impozabila << rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000174A2C6E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x00000174A2C6D950>
    def calculate(self) -> Dict[str, float]:

80 : Job ID ec523455bb4c4dd78cfe89862554ff47
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (10, 30), end pos: (10, 31)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -7,7 +7,7 @@
     def calculate(self) -> Dict[str, float]:
         # Rates are loaded from yearly config via TaxCalculator base class.
         rules = self.rules["employee"]
-        cas = self.venit_brut * rules["cas_rate"]
+        cas = self.venit_brut | rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001A23F99E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000001A23F99D950>

81 : Job ID 6f28806ff1ab4edf80caa01f3dedfb7c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (11, 31), end pos: (11, 32)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -8,7 +8,7 @@
         # Rates are loaded from yearly config via TaxCalculator base class.
         rules = self.rules["employee"]
         cas = self.venit_brut * rules["cas_rate"]
-        cass = self.venit_brut * rules["cass_rate"]
+        cass = self.venit_brut | rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000245BD04A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x00000

82 : Job ID b1cc2617fc1448049c3a0c0d23861d6e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (14, 34), end pos: (14, 35)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -11,7 +11,7 @@
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
-        impozit = baza_impozabila * rules["income_tax_rate"]
+        impozit = baza_impozabila | rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002BD4232E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000002BD4232D950>
    def calculate(self) -> Dict[str, float]:

83 : Job ID 9dde8a11355f4175ba20311d7cc471e2
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (10, 30), end pos: (10, 31)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -7,7 +7,7 @@
     def calculate(self) -> Dict[str, float]:
         # Rates are loaded from yearly config via TaxCalculator base class.
         rules = self.rules["employee"]
-        cas = self.venit_brut * rules["cas_rate"]
+        cas = self.venit_brut & rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002839A24A350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000002839A249950>

84 : Job ID 7de65c484c5449c9a874f7f9e5f41874
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (11, 31), end pos: (11, 32)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -8,7 +8,7 @@
         # Rates are loaded from yearly config via TaxCalculator base class.
         rules = self.rules["employee"]
         cas = self.venit_brut * rules["cas_rate"]
-        cass = self.venit_brut * rules["cass_rate"]
+        cass = self.venit_brut & rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000002D7B717E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x0000

85 : Job ID eb6875125b074ec68f884e9e9a659a85
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (14, 34), end pos: (14, 35)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -11,7 +11,7 @@
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
-        impozit = baza_impozabila * rules["income_tax_rate"]
+        impozit = baza_impozabila & rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001E9E6E6E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000001E9E6E6D950>
    def calculate(self) -> Dict[str, float]:

86 : Job ID 064fef7487e6498fa1fd968ba50ed01f
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (10, 30), end pos: (10, 31)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -7,7 +7,7 @@
     def calculate(self) -> Dict[str, float]:
         # Rates are loaded from yearly config via TaxCalculator base class.
         rules = self.rules["employee"]
-        cas = self.venit_brut * rules["cas_rate"]
+        cas = self.venit_brut ^ rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001988248E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x000001988248D950>

87 : Job ID 8e350ddb776842aeaa291658ea56b8bc
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (11, 31), end pos: (11, 32)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -8,7 +8,7 @@
         # Rates are loaded from yearly config via TaxCalculator base class.
         rules = self.rules["employee"]
         cas = self.venit_brut * rules["cas_rate"]
-        cass = self.venit_brut * rules["cass_rate"]
+        cass = self.venit_brut ^ rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x0000022E8391E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x0000

88 : Job ID 2f771af72f7f4c61ad460def85c4a7a8
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (14, 34), end pos: (14, 35)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -11,7 +11,7 @@
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
         baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
-        impozit = baza_impozabila * rules["income_tax_rate"]
+        impozit = baza_impozabila ^ rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000159BF87E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
>       employee = EmployeeCalculator(0, 2024).calculate()
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
tests\test_boundary_values.py:28: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
self = <calculator_employee.EmployeeCalculator object at 0x00000159BF87D950>
    def calculate(self) -> Dict[str, float]:

89 : Job ID aae9b2c160e442e39c7802e880585b3c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (13, 60), end pos: (13, 63)
operator: core/NumberReplacer, occurrence: 0, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut - cas - cass, 1.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
................F
================================== FAILURES ===================================
___________ TestBoundaryValueAnalysis.test_venit_brut_boundary_zero ___________
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x00000193BE41E350>
    def test_venit_brut_boundary_zero(self):
        """Boundary: exactly zero"""
        employee = EmployeeCalculator(0, 2024).calculate()
>       assert employee["venit_net"] == 0.0
E       assert -0.1 == 0.0
tests\test_boundary_values.py:29: AssertionError
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test

90 : Job ID 7b1125169a86448495b8fe2be508a986
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (13, 60), end pos: (13, 63)
operator: core/NumberReplacer, occurrence: 1, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -10,7 +10,7 @@
         cas = self.venit_brut * rules["cas_rate"]
         cass = self.venit_brut * rules["cass_rate"]
         # Income tax for salary is applied after social contributions.
-        baza_impozabila = max(self.venit_brut - cas - cass, 0.0)
+        baza_impozabila = max(self.venit_brut - cas - cass, -1.0)
         impozit = baza_impozabila * rules["income_tax_rate"]
         total_taxe = cas + cass + impozit
         venit_net = self.venit_brut - total_taxe
........................................................................ [ 91%]
.......                                                                  [100%]
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test_mutation_analysis.py:126: PytestUnknownMarkWarning: Unknown pytest.mark.mutation_killer - is this a typo?  You can register custom marks to avoid this warning - for details, see https://docs.pytest.org/en/stable/how-to/mark.html
    @pytest.mark.mutation_killer
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
79 passed, 1 warning i

91 : Job ID efaab4ad344c4653a85ec419a62e67e6
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (19, 49), end pos: (19, 50)
operator: core/NumberReplacer, occurrence: 2, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -16,7 +16,7 @@
         venit_net = self.venit_brut - total_taxe
         return {
-            "venit_brut": round(self.venit_brut, 2),
+            "venit_brut": round(self.venit_brut, 3),
             "cas": round(cas, 2),
             "cass": round(cass, 2),
             "impozit": round(impozit, 2),
........................................................................ [ 91%]
.......                                                                  [100%]
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test_mutation_analysis.py:126: PytestUnknownMarkWarning: Unknown pytest.mark.mutation_killer - is this a typo?  You can register custom marks to avoid this warning - for details, see https://docs.pytest.org/en/stable/how-to/mark.html
    @pytest.mark.mutation_killer
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
79 passed, 1 warning in 0.13s

92 : Job ID c148d38c690d4ae49bc76d3db04aea24
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (19, 49), end pos: (19, 50)
operator: core/NumberReplacer, occurrence: 3, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -16,7 +16,7 @@
         venit_net = self.venit_brut - total_taxe
         return {
-            "venit_brut": round(self.venit_brut, 2),
+            "venit_brut": round(self.venit_brut, 1),
             "cas": round(cas, 2),
             "cass": round(cass, 2),
             "impozit": round(impozit, 2),
........................................................................ [ 91%]
.......                                                                  [100%]
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test_mutation_analysis.py:126: PytestUnknownMarkWarning: Unknown pytest.mark.mutation_killer - is this a typo?  You can register custom marks to avoid this warning - for details, see https://docs.pytest.org/en/stable/how-to/mark.html
    @pytest.mark.mutation_killer
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
79 passed, 1 warning in 0.27s

93 : Job ID 7a504e4ca165422a8f30bc7c6ec55f1d
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (20, 30), end pos: (20, 31)
operator: core/NumberReplacer, occurrence: 4, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -17,7 +17,7 @@
         return {
             "venit_brut": round(self.venit_brut, 2),
-            "cas": round(cas, 2),
+            "cas": round(cas, 3),
             "cass": round(cass, 2),
             "impozit": round(impozit, 2),
             "total_taxe": round(total_taxe, 2),
........................................................................ [ 91%]
.......                                                                  [100%]
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test_mutation_analysis.py:126: PytestUnknownMarkWarning: Unknown pytest.mark.mutation_killer - is this a typo?  You can register custom marks to avoid this warning - for details, see https://docs.pytest.org/en/stable/how-to/mark.html
    @pytest.mark.mutation_killer
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
79 passed, 1 warning in 0.21s

94 : Job ID ab65f9ad589841a68460530327e36413
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (20, 30), end pos: (20, 31)
operator: core/NumberReplacer, occurrence: 5, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -17,7 +17,7 @@
         return {
             "venit_brut": round(self.venit_brut, 2),
-            "cas": round(cas, 2),
+            "cas": round(cas, 1),
             "cass": round(cass, 2),
             "impozit": round(impozit, 2),
             "total_taxe": round(total_taxe, 2),
........................................................................ [ 91%]
.......                                                                  [100%]
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test_mutation_analysis.py:126: PytestUnknownMarkWarning: Unknown pytest.mark.mutation_killer - is this a typo?  You can register custom marks to avoid this warning - for details, see https://docs.pytest.org/en/stable/how-to/mark.html
    @pytest.mark.mutation_killer
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
79 passed, 1 warning in 0.14s

95 : Job ID c2421bb3c8d14741a744f202b7e2246b
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (21, 32), end pos: (21, 33)
operator: core/NumberReplacer, occurrence: 6, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -18,7 +18,7 @@
         return {
             "venit_brut": round(self.venit_brut, 2),
             "cas": round(cas, 2),
-            "cass": round(cass, 2),
+            "cass": round(cass, 3),
             "impozit": round(impozit, 2),
             "total_taxe": round(total_taxe, 2),
             "venit_net": round(venit_net, 2),
........................................................................ [ 91%]
.......                                                                  [100%]
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test_mutation_analysis.py:126: PytestUnknownMarkWarning: Unknown pytest.mark.mutation_killer - is this a typo?  You can register custom marks to avoid this warning - for details, see https://docs.pytest.org/en/stable/how-to/mark.html
    @pytest.mark.mutation_killer
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
79 passed, 1 warning in 0.20s

96 : Job ID 52c32a5cfc954f33b5eb0d9b1c713870
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (21, 32), end pos: (21, 33)
operator: core/NumberReplacer, occurrence: 7, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -18,7 +18,7 @@
         return {
             "venit_brut": round(self.venit_brut, 2),
             "cas": round(cas, 2),
-            "cass": round(cass, 2),
+            "cass": round(cass, 1),
             "impozit": round(impozit, 2),
             "total_taxe": round(total_taxe, 2),
             "venit_net": round(venit_net, 2),
........................................................................ [ 91%]
.......                                                                  [100%]
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test_mutation_analysis.py:126: PytestUnknownMarkWarning: Unknown pytest.mark.mutation_killer - is this a typo?  You can register custom marks to avoid this warning - for details, see https://docs.pytest.org/en/stable/how-to/mark.html
    @pytest.mark.mutation_killer
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
79 passed, 1 warning in 0.24s
