97 : Job ID b58fe3da0ec74b9dadf4b4d59569609b
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (22, 38), end pos: (22, 39)
operator: core/NumberReplacer, occurrence: 8, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -19,7 +19,7 @@
             "venit_brut": round(self.venit_brut, 2),
             "cas": round(cas, 2),
             "cass": round(cass, 2),
-            "impozit": round(impozit, 2),
+            "impozit": round(impozit, 3),
             "total_taxe": round(total_taxe, 2),
             "venit_net": round(venit_net, 2),
         }
........................................................................ [ 91%]
.......                                                                  [100%]
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test_mutation_analysis.py:126: PytestUnknownMarkWarning: Unknown pytest.mark.mutation_killer - is this a typo?  You can register custom marks to avoid this warning - for details, see https://docs.pytest.org/en/stable/how-to/mark.html
    @pytest.mark.mutation_killer
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
79 passed, 1 warning in 0.20s

98 : Job ID ca42ff2e64c74805867d70b19cac26d6
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (22, 38), end pos: (22, 39)
operator: core/NumberReplacer, occurrence: 9, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -19,7 +19,7 @@
             "venit_brut": round(self.venit_brut, 2),
             "cas": round(cas, 2),
             "cass": round(cass, 2),
-            "impozit": round(impozit, 2),
+            "impozit": round(impozit, 1),
             "total_taxe": round(total_taxe, 2),
             "venit_net": round(venit_net, 2),
         }
........................................................................ [ 91%]
.......                                                                  [100%]
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test_mutation_analysis.py:126: PytestUnknownMarkWarning: Unknown pytest.mark.mutation_killer - is this a typo?  You can register custom marks to avoid this warning - for details, see https://docs.pytest.org/en/stable/how-to/mark.html
    @pytest.mark.mutation_killer
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
79 passed, 1 warning in 0.21s

99 : Job ID 5d2bdc5ccf9e4de8b14634e062e57490
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (23, 44), end pos: (23, 45)
operator: core/NumberReplacer, occurrence: 10, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -20,7 +20,7 @@
             "cas": round(cas, 2),
             "cass": round(cass, 2),
             "impozit": round(impozit, 2),
-            "total_taxe": round(total_taxe, 2),
+            "total_taxe": round(total_taxe, 3),
             "venit_net": round(venit_net, 2),
         }
........................................................................ [ 91%]
.......                                                                  [100%]
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test_mutation_analysis.py:126: PytestUnknownMarkWarning: Unknown pytest.mark.mutation_killer - is this a typo?  You can register custom marks to avoid this warning - for details, see https://docs.pytest.org/en/stable/how-to/mark.html
    @pytest.mark.mutation_killer
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
79 passed, 1 warning in 0.13s

100 : Job ID 4b032cb15c7f4ef19125ba0d683194cc
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (23, 44), end pos: (23, 45)
operator: core/NumberReplacer, occurrence: 11, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -20,7 +20,7 @@
             "cas": round(cas, 2),
             "cass": round(cass, 2),
             "impozit": round(impozit, 2),
-            "total_taxe": round(total_taxe, 2),
+            "total_taxe": round(total_taxe, 1),
             "venit_net": round(venit_net, 2),
         }
........................................................................ [ 91%]
.......                                                                  [100%]
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test_mutation_analysis.py:126: PytestUnknownMarkWarning: Unknown pytest.mark.mutation_killer - is this a typo?  You can register custom marks to avoid this warning - for details, see https://docs.pytest.org/en/stable/how-to/mark.html
    @pytest.mark.mutation_killer
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
79 passed, 1 warning in 0.14s

101 : Job ID 3988ef39a3624ba89bc9ee2405469b0b
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
src\calculator_employee.py, start pos: (24, 42), end pos: (24, 43)
operator: core/NumberReplacer, occurrence: 12, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -21,6 +21,6 @@
             "cass": round(cass, 2),
             "impozit": round(impozit, 2),
             "total_taxe": round(total_taxe, 2),
-            "venit_net": round(venit_net, 2),
+            "venit_net": round(venit_net, 3),
         }
........................................................................ [ 91%]
.......                                                                  [100%]
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test_mutation_analysis.py:126: PytestUnknownMarkWarning: Unknown pytest.mark.mutation_killer - is this a typo?  You can register custom marks to avoid this warning - for details, see https://docs.pytest.org/en/stable/how-to/mark.html
    @pytest.mark.mutation_killer
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
79 passed, 1 warning in 0.21s

102 : Job ID 670957d665a94c86bc35f2012589d99a
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src\calculator_employee.py, start pos: (24, 42), end pos: (24, 43)
operator: core/NumberReplacer, occurrence: 13, definition_name: calculate
--- mutation diff ---
--- asrc\calculator_employee.py
+++ bsrc\calculator_employee.py
@@ -21,6 +21,6 @@
             "cass": round(cass, 2),
             "impozit": round(impozit, 2),
             "total_taxe": round(total_taxe, 2),
-            "venit_net": round(venit_net, 2),
+            "venit_net": round(venit_net, 1),
         }
.................F
================================== FAILURES ===================================
_____ TestBoundaryValueAnalysis.test_venit_brut_boundary_just_above_zero ______
self = <test_boundary_values.TestBoundaryValueAnalysis object at 0x000001C88036EB10>
    def test_venit_brut_boundary_just_above_zero(self):
        """Boundary: just above zero"""
        employee = EmployeeCalculator(0.01, 2024).calculate()
>       assert employee["venit_net"] > 0
E       assert 0.0 > 0
tests\test_boundary_values.py:37: AssertionError
============================== warnings summary ===============================
tests\test_mutation_analysis.py:126
  C:\unibuc\tss\tests\test_mutation_analysis.py:126: PytestUnknownMarkWarning: Unknown pytest.mark.mutation_killer - is this a typo?  You can register custom marks to avoid this warning - for details, see https://docs.pytest.org/en/stable/how
